/* OID.strings
/*
/* This file maps object identifiers (OIDs) to their corresponding labels.
/* These labels are used when displaying the details of a certificate's contents.
/*
/* NOTE TO LOCALIZERS:
/*
/* All strings in this file should eventually be localized. However, not all of them are
/* currently localizable. Specifically, there are a number of acronymns and abbreviations
/* which still need to be expanded into the corresponding English words. [3751398]
/*
/* Acronymns, such as "RSA," "DES," "X.509," "S/MIME," and so on, should be left alone for now.
/* Abbreviated labels such as "id-aa-dvcs-dvc" should also not be localized if present.


/* Deutsche Telekom */

"06 05 02 82 06 01 0A"			= "Telesec";
"06 06 02 82 06 01 0A 00"		= "Розширення Telesec";
"06 06 02 82 06 01 0A 01"		= "Механізм Telesec";

"06 07 02 82 06 01 0A 01 00"	= "Автентифікація Telesec";
"06 08 02 82 06 01 0A 01 00 01"	= "Автентифікація пароля";
"06 08 02 82 06 01 0A 01 00 02" = "Автентифікація захищеного пароля";
"06 08 02 82 06 01 0A 01 00 03" = "Необоротна автентифікація X.509";
"06 08 02 82 06 01 0A 01 00 04" = "Подвійна автентифікація X.509";
"06 08 02 82 06 01 0A 01 00 05" = "Потрійна автентифікація X.509";
"06 08 02 82 06 01 0A 01 00 06" = "Необоротна автентифікація ISO9798";
"06 08 02 82 06 01 0A 01 00 07" = "Подвійна автентифікація ISO9798";
"06 08 02 82 06 01 0A 01 00 08" = "Автентифікація Telekom";

"06 07 02 82 06 01 0A 01 01"	= "Підпис Telesec";
"06 08 02 82 06 01 0A 01 01 01"	= "MD4 з RSA і ISO9697";
"06 08 02 82 06 01 0A 01 01 02"	= "MD4 з RSA і стандарт підпису Telesec";
"06 08 02 82 06 01 0A 01 01 03"	= "MD5 з RSA і ISO9697";
"06 08 02 82 06 01 0A 01 01 04"	= "MD5 з RSA і стандарт підпису Telesec";
"06 08 02 82 06 01 0A 01 01 05"	= "RIPEMD-160 з RSA і стандартним підписом Telekom";
"06 08 02 82 06 01 0A 01 01 09"	= "Підпис RSA HBCI";

"06 07 02 82 06 01 0A 01 02"	= "Шифрування Telesec";
"06 08 02 82 06 01 0A 01 02 00"	= "немає";
"06 08 02 82 06 01 0A 01 02 01"	= "RSA Telesec";
"06 08 02 82 06 01 0A 01 02 02"	= "DES";
"06 09 02 82 06 01 0A 01 02 02 01"	= "DES ECB";
"06 09 02 82 06 01 0A 01 02 02 02"	= "DES CBC";
"06 09 02 82 06 01 0A 01 02 02 03"	= "DES OFB";
"06 09 02 82 06 01 0A 01 02 02 04"	= "DES CFB8";
"06 09 02 82 06 01 0A 01 02 02 05"	= "DES CFB64";
"06 08 02 82 06 01 0A 01 02 03"	= "3DES";
"06 09 02 82 06 01 0A 01 02 03 01"	= "3DES ECB";
"06 09 02 82 06 01 0A 01 02 03 02"	= "3DES CBC";
"06 09 02 82 06 01 0A 01 02 03 03"	= "3DES OFB";
"06 09 02 82 06 01 0A 01 02 03 04"	= "3DES CFB8";
"06 09 02 82 06 01 0A 01 02 03 05"	= "3DES CFB64";
"06 08 02 82 06 01 0A 01 02 04"	= "Magenta";
"06 08 02 82 06 01 0A 01 02 05"	= "IDEA";
"06 09 02 82 06 01 0A 01 02 05 01"	= "IDEA ECB";
"06 09 02 82 06 01 0A 01 02 05 02"	= "IDEA CBC";
"06 09 02 82 06 01 0A 01 02 05 03"	= "IDEA OFB";
"06 09 02 82 06 01 0A 01 02 05 04"	= "IDEA CFB8";
"06 09 02 82 06 01 0A 01 02 05 05"	= "IDEA CFB64";

"06 07 02 82 06 01 0A 01 03"	= "Необоротна функція";
"06 08 02 82 06 01 0A 01 03 01"	= "MD4";
"06 08 02 82 06 01 0A 01 03 02"	= "MD5";
"06 08 02 82 06 01 0A 01 03 03"	= "SqModN-X509";
"06 08 02 82 06 01 0A 01 03 04"	= "SqModN-ISO";
"06 08 02 82 06 01 0A 01 03 05"	= "RIPEMD-128";
"06 08 02 82 06 01 0A 01 03 06"	= "Хеш із блочним шифром";
"06 08 02 82 06 01 0A 01 03 07"	= "MAC";
"06 08 02 82 06 01 0A 01 03 08"	= "RIPEMD-160";

"06 07 02 82 06 01 0A 01 04"	= "Функція FEC";
"06 08 02 82 06 01 0A 01 04 01"	= "Рід Соломон";

"06 06 02 82 06 01 0A 02"		= "Модуль Telesec";
"06 07 02 82 06 01 0A 02 00"	= "Алгоритми";
"06 07 02 82 06 01 0A 02 01"	= "Типи атрибутів";
"06 07 02 82 06 01 0A 02 02"	= "Certificate Types";
"06 07 02 82 06 01 0A 02 03"	= "Типи повідомлень";
"06 07 02 82 06 01 0A 02 04"	= "Протокол PL";
"06 07 02 82 06 01 0A 02 05"	= "SME і компоненти SME";
"06 07 02 82 06 01 0A 02 06"	= "FEC";
"06 07 02 82 06 01 0A 02 07"	= "Корисні визначення";
"06 07 02 82 06 01 0A 02 08"	= "Файли STE";
"06 07 02 82 06 01 0A 02 09"	= "SAdmin";
"06 07 02 82 06 01 0A 02 0A"	= "Електронний порядок";
"06 07 02 82 06 01 0A 02 0B"	= "Асиметрична програма Telesec TTP";
"06 07 02 82 06 01 0A 02 0C"	= "Базисна програма Telesec TTP";
"06 07 02 82 06 01 0A 02 0D"	= "Повідомлення Telesec TTP";
"06 07 02 82 06 01 0A 02 0E"	= "Програма часоих міток Telesec TTP";

"06 06 02 82 06 01 0A 03"		= "Клас об’єкта";
"06 07 02 82 06 01 0A 03 00"	= "Інша назва Telesec";
"06 07 02 82 06 01 0A 03 01"	= "Каталог";
"06 07 02 82 06 01 0A 03 02"	= "Тип каталогу";
"06 07 02 82 06 01 0A 03 03"	= "Група каталогів";
"06 07 02 82 06 01 0A 03 04"	= "Користувач каталогу";
"06 07 02 82 06 01 0A 03 05"	= "Запис симетричного ключа";

"06 06 02 82 06 01 0A 04"		= "Пакет";
"06 06 02 82 06 01 0A 05"		= "Параметр";
"06 06 02 82 06 01 0A 06"		= "Зв’язування імен";
"06 06 02 82 06 01 0A 07"		= "Атрибут";
"06 07 02 82 06 01 0A 07 00"	= "Ідентифікатор групи програм";
"06 07 02 82 06 01 0A 07 01"	= "Тип сертифіката";
"06 07 02 82 06 01 0A 07 02"	= "Сертифікат Telesec";
"06 07 02 82 06 01 0A 07 03"	= "Номер сертифіката";
"06 07 02 82 06 01 0A 07 04"	= "Список відкликання сертифікатів";
"06 07 02 82 06 01 0A 07 05"	= "Дата створення";
"06 07 02 82 06 01 0A 07 06"	= "Видавець";
"06 07 02 82 06 01 0A 07 07"	= "Центр призначення іменн";
"06 07 02 82 06 01 0A 07 08"	= "Каталог відкритого ключа";
"06 07 02 82 06 01 0A 07 09"	= "Безпечний домен";
"06 07 02 82 06 01 0A 07 0A"	= "Тема";
"06 07 02 82 06 01 0A 07 0B"	= "Час відкликання";
"06 07 02 82 06 01 0A 07 0C"	= "Позначення групи користувачів";
"06 07 02 82 06 01 0A 07 0D"	= "Дійсність";
"06 07 02 82 06 01 0A 07 0E"	= "ZERT93";
"06 07 02 82 06 01 0A 07 0F"	= "Безпечне оточнення повідомлення";
"06 07 02 82 06 01 0A 07 10"	= "Анонімний каталог відкритих ключів";
"06 07 02 82 06 01 0A 07 11"	= "Ім’я Telesec";
"06 07 02 82 06 01 0A 07 12"	= "Додатки імен";
"06 07 02 82 06 01 0A 07 13"	= "Поштовий індекс Telesec";
"06 07 02 82 06 01 0A 07 14"	= "Розрізнювач імен
";
"06 07 02 82 06 01 0A 07 15"	= "Список сертифікатів Telesec";
"06 07 02 82 06 01 0A 07 16"	= "Список сертифікатів Teletrust";
"06 07 02 82 06 01 0A 07 17"	= "Список сертифікатів X.509";
"06 07 02 82 06 01 0A 07 18"	= "Час випуску";
"06 07 02 82 06 01 0A 07 19"	= "Номер фізичної карти";
"06 07 02 82 06 01 0A 07 1A"	= "Тип файлу";
"06 07 02 82 06 01 0A 07 1B"	= "Ctl-файл є архівом";
"06 07 02 82 06 01 0A 07 1C"	= "Адреса електронної пошти";
"06 07 02 82 06 01 0A 07 1D"	= "Список шаблонів сертифікатів";
"06 07 02 82 06 01 0A 07 1E"	= "Назва каталогу";
"06 07 02 82 06 01 0A 07 1F"	= "Назва типу каталогу";
"06 07 02 82 06 01 0A 07 20"	= "Назва групи каталогів";
"06 07 02 82 06 01 0A 07 21"	= "Ім’я користувача каталогу";
"06 07 02 82 06 01 0A 07 22"	= "Прапорець відкликання";
"06 07 02 82 06 01 0A 07 23"	= "Назва запису симетричного ключа";
"06 07 02 82 06 01 0A 07 24"	= "Номер GL";
"06 07 02 82 06 01 0A 07 25"	= "Номер GO";
"06 07 02 82 06 01 0A 07 26"	= "Дані ключа G";
"06 07 02 82 06 01 0A 07 27"	= "Дані ключа Z";
"06 07 02 82 06 01 0A 07 28"	= "Дані ключа KT";
"06 07 02 82 06 01 0A 07 2A"	= "Номер ключа KT";
"06 07 02 82 06 01 0A 07 33"	= "Час створення відкликання";
"06 07 02 82 06 01 0A 07 34"	= "Текст про зобов’язання";

"06 06 02 82 06 01 0A 08"		= "Група атрибутів";
"06 06 02 82 06 01 0A 09"		= "Дія";
"06 06 02 82 06 01 0A 0A"		= "Примітка";
"06 06 02 82 06 01 0A 0B"		= "SNMP-MIBS";

"06 07 02 82 06 01 0A 0B 01"	= "Програма безпеки";

"06 06 02 82 06 01 0A 0C"		= "Описи розширень сертифікатів і СВС";

"06 07 02 82 06 01 0A 0C 00"	= "Розширення обмеження зобов’язання розширення сертифіката";
"06 07 02 82 06 01 0A 0C 01"	= "Розширення ідентифікатора сертифіката Telesec";
"06 07 02 82 06 01 0A 0C 02"	= "Ідентифікатор політики Telesec";
"06 07 02 82 06 01 0A 0C 03"	= "Ідентифікатор кваліфікатора політики Telesec";
"06 07 02 82 06 01 0A 0C 04"	= "Відфільтроване розширення СВС Telesec";
"06 07 02 82 06 01 0A 0C 05"	= "Розширення фільтра СВС Telesec";
"06 07 02 82 06 01 0A 0C 06"	= "Розширення центру призначення імен Telesec";

/* RFC 1274 (X.500 attribute collection from the UK, thus the weird OID). */

"06 0A 09 92 26 89 93 F2 2C 64 01 01"	= "Ідентифікатор користувача";
"06 0A 09 92 26 89 93 F2 2C 64 01 03"	= "Поштова скринька RFC822";

/* RFC 2247 */

"06 0A 09 92 26 89 93 F2 2C 64 01 19"	= "Компонент домену";

/* Australian Government */

"06 06 2A 24 01 82 4D 01"   = "Австралійський господарський код";

/* Certificates Australia */

"06 0A 2A 24 A4 97 A3 53 01 64 01 01"	= "Ідентифікатор політики австралійських сертифікатів";

/* Signet */

"06 09 2A 24 A0 F2 A0 7D 01 01 02"	= "Signet Personal";
"06 09 2A 24 A0 F2 A0 7D 01 01 03"	= "Signet Business";
"06 09 2A 24 A0 F2 A0 7D 01 01 04"	= "Signet Legal";
"06 09 2A 24 A0 F2 A0 7D 01 01 0A"	= "Signet Pilot";
"06 09 2A 24 A0 F2 A0 7D 01 01 0B"	= "Signet IntraNet";
"06 09 2A 24 A0 F2 A0 7D 01 01 14"	= "Ідентифікатор політики Signet";

/* Mitsubishi */

"06 0B 2A 83 08 8C 1A 4B 3D 01 01 01"		= "\u0010Алгоритм симетричного шифрування";
"06 0C 2A 83 08 8C 9A 4B 3D 01 01 01 01"	= "MISTY1-CBC";

/* SEIS */

"06 05 2A 85 70 22 01"		= "SEIS CP";
"06 06 2A 85 70 22 01 01"	= "Ідентифікатор політики SEIS High-Assurance";
"06 06 2A 85 70 22 01 02"	= "Ідентифікатор політики GAK SEIS";
"06 05 2A 85 70 22 02"		= "SEIS PE";
"06 05 2A 85 70 22 03"		= "SEIS AT";
"06 06 2A 85 70 22 03 01"	= "Особистий ідентифікатор SEIS";

/* ANSI X9.57 */

"06 06 2A 86 48 CE 38 01"		= "Модуль ANSI X9.57";
"06 07 2A 86 48 CE 38 01 01"	= "Керування сертифікатами X9F1";
"06 06 2A 86 48 CE 38 02"		= "Інструкція утримання";
"06 07 2A 86 48 CE 38 02 01"	= "Інструкція утримання-Немає";
"06 07 2A 86 48 CE 38 02 02"	= "Видавець виклику";
"06 07 2A 86 48 CE 38 02 03"	= "Відхилити";
"06 07 2A 86 48 CE 38 02 04"	= "Вилучити код";
"06 06 2A 86 48 CE 38 03"		= "Атрибут";
"06 06 2A 86 48 CE 38 03 01"	= "Додатковий підпис";
"06 06 2A 86 48 CE 38 03 02"	= "Сертифікат атрибута";
"06 06 2A 86 48 CE 38 04"		= "Алгоритм";
"06 07 2A 86 48 CE 38 04 01"	= "DSA";
"06 07 2A 86 48 CE 38 04 02"	= "Збіг DSA";
"06 07 2A 86 48 CE 38 04 03"	= "DSA з SHA-1";

/* ANSI X9.62 */

"06 06 2A 86 48 CE 3D 01"		= "Тип поля ANSI X9.62";
"06 07 2A 86 48 CE 3D 01 01"	= "Поле простого ключа";
"06 07 2A 86 48 CE 3D 01 02"	= "Характеристика - Два поля";
"06 09 2A 86 48 CE 3D 01 02 03"	= "Характеристика - Дві основи";
"06 0A 2A 86 48 CE 3D 01 02 03 01"	= "Нульовий базисl";
"06 0A 2A 86 48 CE 3D 01 02 03 02"	= "Тричленний базис";
"06 0A 2A 86 48 CE 3D 01 02 03 03"	= "П’ятичленний базис";
"06 06 2A 86 48 CE 3D 02"		= "Тип відкритого ключа";
"06 07 2A 86 48 CE 3D 02 01"	= "Відкритий ключ еліптичної кривої";

/* ANSI X9.42 */

"06 06 2A 86 48 CE 3E 01"		= "Тип поля ANSI X9.42";
"06 07 2A 86 48 CE 3E 01 01"	= "Просте число поля Галуа";
"06 06 2A 86 48 CE 3E 02"		= "Тип числа";
"06 07 2A 86 48 CE 3E 02 01"	= "Відкритий ключ Деффі-Хеллмана";
"06 06 2A 86 48 CE 3E 03"		= "Схема";
"06 07 2A 86 48 CE 3E 03 01"	= "Статичний елемент Деффі-Хеллмана";
"06 07 2A 86 48 CE 3E 03 02"	= "Перехідний елемент Деффі-Хеллмана";
"06 07 2A 86 48 CE 3E 03 03"	= "Гібрид 1 Деффі-Хеллмана";
"06 07 2A 86 48 CE 3E 03 04"	= "Гібрид 2 Деффі-Хеллмана";
"06 07 2A 86 48 CE 3E 03 05"	= "MQV2";
"06 07 2A 86 48 CE 3E 03 06"	= "MQV1";

/* Nortel Secure Networks/Entrust */

"06 07 2A 86 48 86 F6 7D 07"		= "NSN";
"06 08 2A 86 48 86 F6 7D 07 41"		= "NSN-CE";
"06 09 2A 86 48 86 F6 7D 07 41 00"	= "Відомості про версію Entrust";
"06 08 2A 86 48 86 F6 7D 07 42"		= "NSN-Alg";
"06 09 2A 86 48 86 F6 7D 07 42 03"	= "CAST3-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0A"	= "CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0B"	= "CAST5-MAC";
"06 09 2A 86 48 86 F6 7D 07 42 0C"	= "PBE з MD5 і CAST5-CBC";
"06 09 2A 86 48 86 F6 7D 07 42 0D"	= "MAC на основі пароля";
"06 08 2A 86 48 86 F6 7D 07 43"		= "NSN-OC";
"06 09 2A 86 48 86 F6 7D 07 43 0C"	= "Користувач Entrust";
"06 08 2A 86 48 86 F6 7D 07 44"		= "NSN-AT";
"06 09 2A 86 48 86 F6 7D 07 44 00"	= "Відомості ЦС Entrust";
"06 09 2A 86 48 86 F6 7D 07 44 0A"	= "Сертифікат атрибута";

/* PKCS #1 */

"06 08 2A 86 48 86 F7 0D 01 01"		= "PKCS-1";
"06 09 2A 86 48 86 F7 0D 01 01 01"	= "Шифрування RSA";
"06 09 2A 86 48 86 F7 0D 01 01 02"	= "MD2 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 03"	= "MD4 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 04"	= "MD5 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 05"	= "SHA-1 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 06"	= "Шифрування RSA-OAEP (SET)";
"06 09 2A 86 48 86 F7 0D 01 01 07"	= "Шифрування RSA-OAEP";
"06 09 2A 86 48 86 F7 0D 01 01 08"	= "RSA-OAEP-MGF";
"06 09 2A 86 48 86 F7 0D 01 01 09"	= "RSA-OAEP з визначеним ярликом";
"06 09 2A 86 48 86 F7 0D 01 01 0A"	= "Схема підпису RSA-PSS";
"06 09 2A 86 48 86 F7 0D 01 01 0B"	= "SHA-256 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0C"	= "SHA-384 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0D"	= "SHA-512 з шифруванням RSA";
"06 09 2A 86 48 86 F7 0D 01 01 0E"	= "SHA-224 з шифруванням RSA";

/* BSAFE/PKCS #2 (obsolete) */

"06 08 2A 86 48 86 F7 0D 01 02"		= "Шифрування за технологією RSA BSAFE";

/* PKCS #3 */

"06 08 2A 86 48 86 F7 0D 01 03"		= "PKCS-3";
"06 09 2A 86 48 86 F7 0D 01 03 01"	= "Угода ключів Деффі-Хеллмана";

/* PKCS #5 */

"06 08 2A 86 48 86 F7 0D 01 05"		= "PKCS-5";
"06 09 2A 86 48 86 F7 0D 01 05 01"	= "PBE з MD2 і DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 03"	= "PBE з MD5 і DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 04"	= "PBE з MD2 і RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 06"	= "PBE з MD5 і RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 09"	= "PBE з MD5 і XOR";
"06 09 2A 86 48 86 F7 0D 01 05 0A"	= "PBE з SHA і DES-CBC";
"06 09 2A 86 48 86 F7 0D 01 05 0C"	= "PKCS-5 PBKDF2";
"06 09 2A 86 48 86 F7 0D 01 05 0D"	= "PKCS-5 PBES2";
"06 09 2A 86 48 86 F7 0D 01 05 0E"	= "PKCS-5 PBMAC1";

/* PKCS #7 */

"06 08 2A 86 48 86 F7 0D 01 07"		= "PKCS-7";
"06 09 2A 86 48 86 F7 0D 01 07 01"	= "ДаніДані";
"06 09 2A 86 48 86 F7 0D 01 07 02"	= "Підписані дані";
"06 09 2A 86 48 86 F7 0D 01 07 03"	= "Загорнені дані";
"06 09 2A 86 48 86 F7 0D 01 07 04"	= "Підписані та загорнуті дані";
"06 09 2A 86 48 86 F7 0D 01 07 05"	= "Дайджест-дані";
"06 09 2A 86 48 86 F7 0D 01 07 06"	= "Шифровані дані";
"06 09 2A 86 48 86 F7 0D 01 07 07"	= "Дані з атрибутами";
"06 09 2A 86 48 86 F7 0D 01 07 08"	= "Шифровані дані про особистий ключ";

/* PKCS #9 */

"06 08 2A 86 48 86 F7 0D 01 09"		= "PKCS-9";
"06 09 2A 86 48 86 F7 0D 01 09 01"	= "Адреса електронної пошти";
"06 09 2A 86 48 86 F7 0D 01 09 02"	= "Назва без структури";
"06 09 2A 86 48 86 F7 0D 01 09 03"	= "Тип вмісту";
"06 09 2A 86 48 86 F7 0D 01 09 04"	= "Дайджест повідомлення";
"06 09 2A 86 48 86 F7 0D 01 09 05"	= "Час підписання";
"06 09 2A 86 48 86 F7 0D 01 09 06"	= "Додатковий підпис";
"06 09 2A 86 48 86 F7 0D 01 09 07"	= "Пароль виклику";
"06 09 2A 86 48 86 F7 0D 01 09 08"	= "Адреса без структури";
"06 09 2A 86 48 86 F7 0D 01 09 09"	= "Атрибути розширеного сертифіката";
"06 09 2A 86 48 86 F7 0D 01 09 0A"	= "Видавець і серійний номер";
"06 09 2A 86 48 86 F7 0D 01 09 0B"	= "Перевірка пароля";
"06 09 2A 86 48 86 F7 0D 01 09 0C"	= "Відкритий ключ";
"06 09 2A 86 48 86 F7 0D 01 09 0D"	= "Опис підписання";
"06 09 2A 86 48 86 F7 0D 01 09 0E"	= "Запит на розширення";

/* PKCS #9 for use with S/MIME */

"06 09 2A 86 48 86 F7 0D 01 09 0F"		= "Можливості S/MIME
";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 01"	= "Надавати перевагу підписаним даним";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 02"	= "Не вдається розшифрувати жоден";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 03"	= "Запит на отримання";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 04"	= "Отримання";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 05"	= "Підказки про вміст";
"06 0A 2A 86 48 86 F7 0D 01 09 0F 06"	= "Історія розширення списку розсилки";

"06 09 2A 86 48 86 F7 0D 01 09 10"			= "S/MIME";

/* S/MIME Modules */

"06 0A 2A 86 48 86 F7 0D 01 09 10 00"		= "Модулі S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 01"	= "Синтаксис криптографічного повідомлення";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 02"	= "Удосконалені служби захисту";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 03"	= "Ідентифікатор об’єкта S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 04"	= "Повідомлення V3 S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 05"	= "Електронний підпис ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 06"	= "Електронний підпис ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 07"	= "Політика електронного підпису ETS 88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 08"	= "Політика електронного підпису ETS 97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 09"	= "id-mod-certdist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0A"	= "id-mod-domsec";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0B"	= "id-mod-compress";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0C"	= "id-mod-symkeydist";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0D"	= "id-mod-cek-reuse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0E"	= "id-mod-cms-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 0F"	= "id-mod-v1AttrCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 10"	= "id-mod-cmsalg-2001";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 11"	= "id-mod-cms-pwri-88";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 12"	= "id-mod-cms-pwri-97";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 13"	= "id-mod-cms-aes";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 14"	= "id-mod-cms-rsaes-oaep";
"06 0B 2A 86 48 86 F7 0D 01 09 10 00 15"	= "id-mod-msg-v3dot1";

/* S/MIME Content Types */

"06 0A 2A 86 48 86 F7 0D 01 09 10 01"		= "Типи вмісту S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 01"	= "id-ct-receipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 02"	= "id-ct-authData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 03"	= "id-ct-publishCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 04"	= "id-ct-TSTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 05"	= "id-ct-TDTInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 06"	= "id-ct-contentInfo";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 07"	= "id-ct-DVCSRequestData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 08"	= "id-ct-DVCSResponseData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 09"	= "id-ct-compressedData";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0A"	= "id-ct-svcp-certValRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0B"	= "id-ct-svcp-certValResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0C"	= "id-ct-svcp-valPolRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0D"	= "id-ct-svcp-valPolResponse";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0E"	= "id-ct-attrCertEncAttrs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 01 0F"	= "id-ct-TSReq";

/* S/MIME Authenticated Attributes */

"06 0A 2A 86 48 86 F7 0D 01 09 10 02"		= "Автентифіковані атрибути S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 01"	= "id-aa-receiptRequest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 02"	= "id-aa-securityLabel";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 03"	= "id-aa-mlExpandHistory";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 04"	= "id-aa-contentHint";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 05"	= "id-aa-msgSigDigest";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 06"	= "id-aa-encapContentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 07"	= "id-aa-contentIdentifier";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 08"	= "id-aa-macValue";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 09"	= "id-aa-equivalentLabels";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0A"	= "iid-aa-contentReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0B"	= "id-aa-encrypKeyPref";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0C"	= "id-aa-signingCertificate";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0D"	= "id-aa-smimeEncryptCerts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0E"	= "id-aa-timeStampToken";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 0F"	= "id-aa-ets-sigPolicyId";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 10"	= "id-aa-ets-commitmentType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 11"	= "id-aa-ets-signerLocation";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 12"	= "id-aa-ets-signerAttr";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 13"	= "id-aa-ets-otherSigCert";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 14"	= "id-aa-ets-contentTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 15"	= "id-aa-ets-CertificateRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 16"	= "id-aa-ets-RevocationRefs";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 17"	= "id-aa-ets-certValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 18"	= "id-aa-ets-revocationValues";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 19"	= "id-aa-ets-escTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1A"	= "id-aa-ets-certCRLTimestamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1B"	= "id-aa-ets-archiveTimeStamp";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1C"	= "id-aa-signatureType";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1D"	= "id-aa-dvcs-dvc";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1E"	= "id-aa-CEKReference";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 1F"	= "id-aa-maxCEKDecrypts";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 20"	= "id-aa-KEKDerivationAlg";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 21"	= "id-aa-intendedRecipients";
"06 0B 2A 86 48 86 F7 0D 01 09 10 02 22"	= "id-aa-cmc-unsignedData";

/* S/MIME Algorithms */

"06 0A 2A 86 48 86 F7 0D 01 09 10 03"		= "Алгоритм S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 01"	= "id-alg-ESDHwith3DES";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 02"	= "id-alg-ESDHwithRC2";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 03"	= "id-alg-3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 04"	= "id-alg-RC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 05"	= "id-alg-ESDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 06"	= "id-alg-CMS3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 07"	= "id-alg-CMSRC2wrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 08"	= "id-alg-zlib";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 09"	= "id-alg-PWRI-KEK";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0A"	= "id-alg-SSDH";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0B"	= "id-alg-HMACwith3DESwrap";
"06 0B 2A 86 48 86 F7 0D 01 09 10 03 0C"	= "id-alg-HMACwithAESwrap";

/* S/MIME Certificate Distribution */

"06 0A 2A 86 48 86 F7 0D 01 09 10 04"		= "Розподіл сертифікатів S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 04 01"	= "Розподіл сертифікатів LDAP";

/* S/MIME Signature Policy Qualifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 05"		= "Кваліфікатор політики підпису S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 01"	= "id-spq-ets-sqt-uri";
"06 0B 2A 86 48 86 F7 0D 01 09 10 05 02"	= "id-spq-ets-sqt-unotice";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 01"	= "id-cti-ets-proofOfOrigin";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 02"	= "id-cti-ets-proofOfReceipt";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 03"	= "id-cti-ets-proofOfDelivery";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 04"	= "id-cti-ets-proofOfSender";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 05"	= "id-cti-ets-proofOfApproval";
"06 0B 2A 86 48 86 F7 0D 01 09 10 06 06"	= "id-cti-ets-proofOfCreation";

/* S/MIME Signature Type Identifier */

"06 0A 2A 86 48 86 F7 0D 01 09 10 09"		= "Ідентифікатор типу підпису S/MIME";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 01"	= "Підпис ініціатора";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 02"	= "Підпис домену";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 03"	= "Підпис додаткових атрибутів";
"06 0B 2A 86 48 86 F7 0D 01 09 10 09 04"	= "Переглянути підпис";

/* S/MIME Capabilities */

"06 0A 2A 86 48 86 F7 0D 01 09 10 0B"		= "Можливості S/MIME
";
"06 0B 2A 86 48 86 F7 0D 01 09 10 0B 01"	= "Надавати перевагу бінарному поданню";

/* PKCS #9 for use with PKCS #12 */

"06 09 2A 86 48 86 F7 0D 01 09 14"			= "Псевдонім (для PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 15"			= "Ідентифікатор локального ключа (для PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 16"			= "Типи сертифікатів (для PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 01"		= "Сертифікат X.509 (для PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 16 02"		= "Сертифікат SDSI (для PKCS-12)";
"06 09 2A 86 48 86 F7 0D 01 09 17"			= "Типи СВС (для PKCS-12)";
"06 0A 2A 86 48 86 F7 0D 01 09 17 01"		= "СВС X.509 (для PKCS-12)";

/* PKCS #12 */

"06 08 2A 86 48 86 F7 0D 01 0C"				= "Синтаксис обміну особистими відомостями PKCS-12";
"06 09 2A 86 48 86 F7 0D 01 0C 01"			= "Ідентифікатори шифрування на основі пароля PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 01"		= "PBE з SHA-1 і 128-розрядним RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 02"		= "PBE з SHA-1 і 40-розрядним RC4";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 03"		= "PBE з SHA-1 і потрійний DES-CBC з 3 ключами";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 04"		= "PBE з SHA-1 і потрійний DES-CBC з 2 ключами";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 05"		= "PBE з SHA-1 і 128-розрядним RC2-CBC";
"06 0A 2A 86 48 86 F7 0D 01 0C 01 06"		= "PBE з SHA-1 і 40-розрядним RC2-CBC";
"06 09 2A 86 48 86 F7 0D 01 0C 02"			= "Ідентифікатори ESPVK PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 02 01"		= "Приховування ключа PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 03"			= "Ідентифікатори кошика PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 01"		= "Ідентифікатор кошика ключа PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 02"		= "Ідентифікатор кошиків сертифіката PKCS-12 і СВС";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 03"		= "Ідентифікатор потайного кошика PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 04"		= "Ідентифікатор безпечного вмісту PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 03 05"		= "Ідентифікатор кошика прихованого ключа PKCS-12 PKCS-8";
"06 09 2A 86 48 86 F7 0D 01 0C 04"			= "Ідентифікатор кошика сертифіката PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 01"		= "Ідентифікатор кошика сертифіката PKCS-12 X.509 і СВС";
"06 0A 2A 86 48 86 F7 0D 01 0C 04 02"		= "Ідентифікатор кошика сертифіката SDSI PKCS-12";

"06 09 2A 86 48 86 F7 0D 01 0C 05"			= "PKCS-12 OID";
"06 0A 2A 86 48 86 F7 0D 01 0C 05 01"		= "Ідентифікатор шифрування на основі пароля PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 01"	= "PKCS-12 PBE з SHA-1 і 128-розрядним RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 02"	= "PKCS-12 PBE з SHA-1 і 40-розрядним RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 03"	= "PKCS-12 PBE з SHA-1 і потрійний DES-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 04"	= "PKCS-12 PBE з SHA-1 і 128-розрядним RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 05"	= "PKCS-12 PBE з SHA-1 і 40-розрядним RC2-CBC";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 06"	= "PKCS-12 PBE з SHA-1 і RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 01 07"	= "PKCS-12 PBE з SHA-1 і RC2-CBC";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 02"		= "Загорнуті ідентифікатори PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 01"	= "Шифрування RSA PKCS-12 з 128-розрядним RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 02"	= "Шифрування RSA PKCS-12 з 40-розрядним RC4";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 02 03"	= "Шифрування RSA PKCS-12 з потрійним DES";

"06 0A 2A 86 48 86 F7 0D 01 0C 05 03"		= "Ідентифікатор підпису PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 05 03 01"	= "Підпис RSA PKCS-12 з дайджестом SHA-1";

"06 09 2A 86 48 86 F7 0D 01 0C 0A"			= "Версія 1 PKCS-12";
"06 0A 2A 86 48 86 F7 0D 01 0C 0A 01"		= "Ідентифікатори кошика PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 01"	= "Кошик ключа PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 02"	= "Кошик прихованого ключа PKCS-12 PKCS-8";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 03"	= "Кошик сертифіката PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 04"	= "Кошик СВС PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 05"	= "Потайний кошик PKCS-12";
"06 0B 2A 86 48 86 F7 0D 01 0C 0A 01 06"	= "Кошик безпечного вмісту PKCS-12";

/* PKCS #15 */

"06 09 2A 86 48 86 F7 0D 01 0F 01"		= "Модулі PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 02"		= "Атрибути PKCS-15";
"06 09 2A 86 48 86 F7 0D 01 0F 03"		= "Тип вмісту PKCS-15";
"06 0A 2A 86 48 86 F7 0D 01 0F 03 01"	= "Вміст PKCS-15";

/* RSADSI digest algorithms */

"06 08 2A 86 48 86 F7 0D 02"			= "Алгоритм дайджеста RSADSI";
"06 08 2A 86 48 86 F7 0D 02 02"			= "MD2";
"06 08 2A 86 48 86 F7 0D 02 04"			= "MD4";
"06 08 2A 86 48 86 F7 0D 02 05"			= "MD5";
"06 08 2A 86 48 86 F7 0D 02 07"			= "HMAC з SHA-1";

/* RSADSI encryption algorithms */

"06 08 2A 86 48 86 F7 0D 03"			= "Алгоритм шифрування RSADSI";
"06 08 2A 86 48 86 F7 0D 03 02"			= "RC2-CBC";
"06 08 2A 86 48 86 F7 0D 03 03"			= "RC2-ECB";
"06 08 2A 86 48 86 F7 0D 03 04"			= "RC4";
"06 08 2A 86 48 86 F7 0D 03 05"			= "RC4 з MAC";
"06 08 2A 86 48 86 F7 0D 03 06"			= "DESX-CBC";
"06 08 2A 86 48 86 F7 0D 03 07"			= "DES-EDE3-CBC";
"06 08 2A 86 48 86 F7 0D 03 08"			= "RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 09"			= "Блокнот RC5-CBC";
"06 08 2A 86 48 86 F7 0D 03 0A"			= "DES-CDMF";

/* Identrus */

"06 09 2A 86 48 86 FA 65 01 06 01"		= "Ідентифікатор невідомої політики Identrus";
"06 08 2A 86 48 86 FA 65 04 01"			= "Identrus OCSP";

/* Ascom Systech */

"06 0A 2B 06 01 04 01 81 3C 07 01 01"		= "Ascom";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 01"	= "IDEA-ECB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 02"	= "IDEA-CBC";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 03"	= "IDEA-CFB";
"06 0B 2B 06 01 04 01 81 3C 07 01 01 04"	= "IDEA-OFB";

/* MIT */

"06 09 2A 86 48 86 F7 12 01 02 02"			= "MIT Kerberos V5";
"06 0A 2A 86 48 86 F7 12 01 02 02 03"		= "MIT User-to-User Kerberos";

/* Microsoft */

"06 09 2A 86 48 82 F7 12 01 02 02"			= "Microsoft Kerberos";

"06 08 2A 86 48 86 F7 14 01 03"				= "Клас об’єкта Microsoft Exchange Server";
"06 09 2A 86 48 86 F7 14 01 03 00"			= "Сайт-адресація";
"06 09 2A 86 48 86 F7 14 01 03 0D"			= "Схема класу";
"06 09 2A 86 48 86 F7 14 01 03 0E"			= "Схема атрибута";
"06 09 2A 86 48 86 F7 14 01 03 11"			= "Поштова скринька-Агент";
"06 09 2A 86 48 86 F7 14 01 03 16"			= "Поштова скринька";
"06 09 2A 86 48 86 F7 14 01 03 17"			= "Контейнер";
"06 09 2A 86 48 86 F7 14 01 03 2E"			= "Одержувач пошти";
"06 09 2A 86 48 86 F7 14 01 02 81 71"		= "Механізм доставки";

"06 07 2A 86 48 86 F7 14 04"				= "Формати файлів Microsoft";
"06 08 2A 86 48 86 F7 14 04 02"				= "Microsoft Word";
"06 08 2A 86 48 86 F7 14 04 03"				= "Microsoft Excel";
"06 08 2A 86 48 86 F7 14 04 04"				= "Microsoft Project";
"06 08 2A 86 48 86 F7 14 04 05"				= "Microsoft PowerPoint";
"06 08 2A 86 48 86 F7 14 04 06"				= "Microsoft Works";

"06 08 2B 06 01 04 01 82 37 02"				= "Підпис програмного коду";
"06 0A 2B 06 01 04 01 82 37 02 01 04"		= "Непрямий контекст даних SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0A"		= "Відомості про службу SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0B"		= "Тип заяви SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0C"		= "Відомості SPC Opus";
"06 0A 2B 06 01 04 01 82 37 02 01 0E"		= "Розширення сертифікатів SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 0F"		= "Дані про зображення SPC PE";
"06 0A 2B 06 01 04 01 82 37 02 01 14"		= "Посилання SPC (тип 1)";
"06 0A 2B 06 01 04 01 82 37 02 01 15"		= "Підписання індивідуального коду";
"06 0A 2B 06 01 04 01 82 37 02 01 16"		= "Підписання комерційного коду";
"06 0A 2B 06 01 04 01 82 37 02 01 19"		= "Посилання SPC (тип 2)";
"06 0A 2B 06 01 04 01 82 37 02 01 1A"		= "Мінімальні критерії SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1B"		= "Фінансові критерії SPC";
"06 0A 2B 06 01 04 01 82 37 02 01 1C"		= "Посилання SPC (тип 3)";

"06 0A 2B 06 01 04 01 82 37 02 02 0A"		= "Постачальник підтримки захисту NTLM";
"06 0A 2B 06 01 04 01 82 37 03 02 01"		= "Додатковий підпис мітки часу";

"06 09 2B 06 01 04 01 82 37 0A 01"			= "Список безпечних сертифікатів";
"06 0A 2B 06 01 04 01 82 37 0A 01 01"		= "Розширення відсортованого CTL";
"06 09 2B 06 01 04 01 82 37 0A 02"			= "Розташування наступного оновлення";

"06 09 2B 06 01 04 01 82 37 0A 03"			= "Використання вдосконаленого ключа";
"06 0A 2B 06 01 04 01 82 37 0A 03 01"		= "Підписання списоку безпечних сертифікатів";
"06 0A 2B 06 01 04 01 82 37 0A 03 02"		= "Підписання мітки часу
";
"06 0A 2B 06 01 04 01 82 37 0A 03 03"		= "Server Gated Crypto";
"06 0B 2B 06 01 04 01 82 37 0A 03 03 01"	= "Серійне шифрування";
"06 0A 2B 06 01 04 01 82 37 0A 03 04"		= "Шифровані файлові системи";
"06 0B 2B 06 01 04 01 82 37 0A 03 04 01"	= "Відновлення шифрованих файлових систем";
"06 0A 2B 06 01 04 01 82 37 0A 03 05"		= "Сумісний з обладнанням Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 06"		= "Підписання NT5";
"06 0A 2B 06 01 04 01 82 37 0A 03 07"		= "Підписання виробників обладнання для Windows";
"06 0A 2B 06 01 04 01 82 37 0A 03 08"		= "Вбудуване підписання NT";
"06 0A 2B 06 01 04 01 82 37 0A 03 09"		= "Підписання списку безпечних коренів";
"06 0A 2B 06 01 04 01 82 37 0A 03 0A"		= "Засвідчена субординація";
"06 0A 2B 06 01 04 01 82 37 0A 03 0B"		= "Відновлення ключа";
"06 0A 2B 06 01 04 01 82 37 0A 03 0C"		= "Підписання документа";

"06 09 2B 06 01 04 01 82 37 0A 04"			= "Ідентифікатор об’єкта атрибута";
"06 0A 2B 06 01 04 01 82 37 0A 04 01"		= "Атрибут довіри Так/Ні";
"06 0A 2B 06 01 04 01 82 37 0A 05 01"		= "Microsoft Music DRM";
"06 0A 2B 06 01 04 01 82 37 0A 05 02"		= "Індивідуалізація DRM Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 01"		= "Ліцензії Microsoft";
"06 0A 2B 06 01 04 01 82 37 0A 06 02"		= "Сервер ліцензій Microsoft";

"06 08 2B 06 01 04 01 82 37 0D"				= "Ідентифікатори об’єктів PKCS-10 Microsoft";
"06 09 2B 06 01 04 01 82 37 0D 01"			= "Сертифікат оновлення";
"06 0A 2B 06 01 04 01 82 37 0D 02 01"		= "Пара імені/значення реєстрації";
"06 0A 2B 06 01 04 01 82 37 0D 02 02"		= "Реєстрація CSP";
"06 0A 2B 06 01 04 01 82 37 0D 02 03"		= "Версія ОС";
"06 08 2B 06 01 04 01 82 37 0F"				= "Microsoft Java";
"06 08 2B 06 01 04 01 82 37 10"				= "Microsoft Outlook/Exchange";
"06 09 2B 06 01 04 01 82 37 10 04"			= "Microsoft Outlook Express";
"06 08 2B 06 01 04 01 82 37 11"				= "Атрибути PKCS-12 Microsoft";
"06 09 2B 06 01 04 01 82 37 11 01"			= "Набір ключів локальної машини";

"06 08 2B 06 01 04 01 82 37 14"				= "Інфраструктура реєстрації Microsoft";
"06 09 2B 06 01 04 01 82 37 14 01"			= "Використання Auto-Enroll CTL";
"06 09 2B 06 01 04 01 82 37 14 02"			= "Тип сертифіката реєстрації";
"06 0A 2B 06 01 04 01 82 37 14 02 01"		= "Агент реєстрації";
"06 0A 2B 06 01 04 01 82 37 14 02 02"		= "Вхід із Smartcard";
"06 0A 2B 06 01 04 01 82 37 14 02 03"		= "Основне ім’я NT";

"06 08 2B 06 01 04 01 82 37 15"				= "Інфраструктура сервера сертифікатів Microsoft";
"06 09 2B 06 01 04 01 82 37 15 01"			= "Версія оновлення ЦС Microsoft";
"06 08 2B 06 01 04 01 82 37 58"				= "CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 01"			= "Версія CAPICOM";
"06 09 2B 06 01 04 01 82 37 58 02"			= "Атрибут CAPICOM";
"06 0A 2B 06 01 04 01 82 37 58 02 01"		= "Назва документа";
"06 0A 2B 06 01 04 01 82 37 58 02 02"		= "Опис документа";
"06 09 2B 06 01 04 01 82 37 58 03"			= "Шифровані дані";
"06 0A 2B 06 01 04 01 82 37 58 03 01"		= "Шифрований вміст";

/* UNINETT */

"06 0A 2B 06 01 04 01 92 7C 0A 01 01"		= "Ідентифікатор політики UNINETT";

/* ICE-TEL */

"06 08 2B 06 01 04 01 95 18 0A"				= "Ідентифікатор політики ICE-TEL";
"06 0A 2B 06 01 04 01 95 62 01 01 01"		= "Ідентифікатор політики ЦС ICE-TEL";

/* cryptlib */

"06 0A 2B 06 01 04 01 97 55 01 01 01"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 02"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 03"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 01 04"		= "Blowfish-CBC";
"06 0A 2B 06 01 04 01 97 55 01 02 01"		= "ElGamal";
"06 0B 2B 06 01 04 01 97 55 01 02 01 01"	= "ElGamal з SHA-1";
"06 0B 2B 06 01 04 01 97 55 01 02 01 02"	= "ElGamal з RIPEMD-160";
"06 09 2B 06 01 04 01 97 55 03 01"			= "атрибути cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 01"		= "перевірка присутності cryptlib";
"06 0A 2B 06 01 04 01 97 55 03 01 02"		= "Віповідь OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 03"		= "Розширена відповідь OCSP RTCS";
"06 0A 2B 06 01 04 01 97 55 03 01 04"		= "Розширена причина СВС";
"06 0A 2B 06 01 04 01 97 55 03 01 05"		= "Характеристики ключа";
"06 0A 2B 06 01 04 01 97 55 03 01 06"		= "PKI Boot";
"06 09 2B 06 01 04 01 97 55 04 01"			= "вміст cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 01"		= "дані конфігурації cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 02"		= "індекс користувача cryptlib";
"06 0A 2B 06 01 04 01 97 55 04 01 03"		= "відомості користувача cryptlib";
"06 0B 2B 06 01 04 01 97 55 2A D7 24 01"	= "MPEG-1";
"06 0C 2B 06 01 04 01 97 55 58 59 5A 5A 59"	= "Ідентифікатор політики XYZZY";

/* Timeproof (www.timeproof.de) */

"06 07 2B 06 01 04 01 AA 60"		= "Довгостроковий";
"06 08 2B 06 01 04 01 AA 60 01"		= "Система підпису часу";
"06 09 2B 06 01 04 01 AA 60 01 01"	= "Система підпису часу 80";
"06 09 2B 06 01 04 01 AA 60 01 02"	= "Система підпису часу 380";
"06 09 2B 06 01 04 01 AA 60 01 03"	= "Система підпису часу 400";

/* MEDePass */

"06 09 2B 06 01 04 01 AD 0A 00 03"  = "Другорядні методи";
"06 09 2B 06 01 04 01 AD 0A 00 04"  = "Ідентифікатори лікаря";

/* Kerberos */

"06 05 2B 06 01 05 02"              = "Kerberos v5";
"06 06 2B 06 01 05 02 03"           = "Kerberos PKINIT";
"06 07 2B 06 01 05 02 03 01"        = "Дані автентифікації Kerberos";
"06 07 2B 06 01 05 02 03 02"        = "Дані ключа Деффі-Хеллмана Kerberos";
"06 07 2B 06 01 05 02 03 03"        = "Дані ключів відповідей Kerberos";
"06 07 2B 06 01 05 02 03 04"        = "Автентифікація Kerberos Client";
"06 07 2B 06 01 05 02 03 05"        = "Центр розподілу ключів Kerberos (KDC)";

/* IANA */

"06 06 2B 06 01 05 05 01"			= "Механізм простих відкритих ключів (SPKM)";
"06 06 2B 06 01 05 05 02"			= "SPNEGO";

/* PKIX */

"06 06 2B 06 01 05 05 07"			= "Інфраструктура відкритого ключа";

"06 07 2B 06 01 05 05 07 01"		= "Розширення особистих сертифікатів PKIX";
"06 08 2B 06 01 05 05 07 01 01"		= "Доступ до відомостей центрів сертифікації";
"06 08 2B 06 01 05 05 07 01 02"		= "Біометричні відомості";
"06 08 2B 06 01 05 05 07 01 03"		= "Засвідчені твердження сертифіката";
"06 08 2B 06 01 05 05 07 01 04"		= "Цифровий підпис перевірки сетрифіката атрибута";
"06 08 2B 06 01 05 05 07 01 05"		= "Збір даних щодо сертифіката атрибута";
"06 08 2B 06 01 05 05 07 01 06"		= "Елементи керування повноваженнями сетрифіката атрибута";
"06 08 2B 06 01 05 05 07 01 07"		= "Блок IP-адрес SBGP";
"06 08 2B 06 01 05 05 07 01 08"		= "Ідентифікатор автономної системи SBGP";
"06 08 2B 06 01 05 05 07 01 09"		= "Ідентифікатор роутера SBGP";
"06 08 2B 06 01 05 05 07 01 0A"		= "Передача повноважень на сертифікат атрибута";
"06 08 2B 06 01 05 05 07 01 0B"		= "Інформаційний доступ до теми";
"06 08 2B 06 01 05 05 07 01 0C"		= "Логотип";

"06 07 2B 06 01 05 05 07 02"		= "Типи кваліфікаторів політик";
"06 08 2B 06 01 05 05 07 02 01"		= "Затвердження порядку сертифікації";
"06 08 2B 06 01 05 05 07 02 02"		= "Примітка користувача";
"06 08 2B 06 01 05 05 07 02 03"		= "Текстова примітка";

"06 07 2B 06 01 05 05 07 03"		= "Завдання ключа";
"06 08 2B 06 01 05 05 07 03 01"		= "Автентифікація сервера";
"06 08 2B 06 01 05 05 07 03 02"		= "Автентифікація клієнта";
"06 08 2B 06 01 05 05 07 03 03"		= "Підписання коду";
"06 08 2B 06 01 05 05 07 03 04"		= "Захист електронної пошти";
"06 08 2B 06 01 05 05 07 03 05"		= "Кінцева система IPSEC";
"06 08 2B 06 01 05 05 07 03 06"		= "Тунель IPSEC";
"06 08 2B 06 01 05 05 07 03 07"		= "Користувач IPSEC";
"06 08 2B 06 01 05 05 07 03 08"		= "Додавання мітки часу";
"06 08 2B 06 01 05 05 07 03 09"		= "Підписання OCSP";
"06 08 2B 06 01 05 05 07 03 0A"		= "DVCS";
"06 08 2B 06 01 05 05 07 03 0B"		= "Автентифікація сервера AA SBGP";

"06 07 2B 06 01 05 05 07 04"		= "Типи інформації CMP";
"06 08 2B 06 01 05 05 07 04 01"		= "Сертифікат шифрування протоколів ЦС";
"06 08 2B 06 01 05 05 07 04 02"		= "Типи підписання пар ключів";
"06 08 2B 06 01 05 05 07 04 03"		= "Типи пар ключів шифрування";
"06 08 2B 06 01 05 05 07 04 04"		= "Пріоритетний симетричний алгоритм";
"06 08 2B 06 01 05 05 07 04 05"		= "Відомості про оновлення ключів ЦС";
"06 08 2B 06 01 05 05 07 04 06"		= "Поточний СВС";
"06 08 2B 06 01 05 05 07 04 07"		= "Непідтримувані OIDs";
"06 08 2B 06 01 05 05 07 04 08"		= "Запит на передплату";
"06 08 2B 06 01 05 05 07 04 09"		= "Відповідь на передплату";
"06 08 2B 06 01 05 05 07 04 0A"		= "Запит про параметри пари ключів";
"06 08 2B 06 01 05 05 07 04 0B"		= "Відповідь щодо параметрів пари ключів";
/* %%% need to expand these labels, but can't find them documented anywhere online! */
"06 08 2B 06 01 05 05 07 04 0C"		= "revPassphrase";
"06 08 2B 06 01 05 05 07 04 0D"		= "implicitConfirm";
"06 08 2B 06 01 05 05 07 04 0E"		= "confirmWaitTime";
"06 08 2B 06 01 05 05 07 04 0F"		= "origPKIMessage";
"06 08 2B 06 01 05 05 07 04 10"		= "suppLangTags";

"06 07 2B 06 01 05 05 07 05"		= "Реєстрація CRMF";
"06 08 2B 06 01 05 05 07 05 01"		= "Зареєстрований елемент керування";
"06 09 2B 06 01 05 05 07 05 01 01"	= "Зареєстрований кода";
"06 09 2B 06 01 05 05 07 05 01 02"	= "Автентифікатор";
"06 09 2B 06 01 05 05 07 05 01 03"	= "Відомості про опублікування PKI";
"06 09 2B 06 01 05 05 07 05 01 04"	= "Параметри архіву PKI";
"06 09 2B 06 01 05 05 07 05 01 05"	= "Ідентифікатор старого сертифіката";
"06 09 2B 06 01 05 05 07 05 01 06"	= "Ключ шифрування протоколу";
"06 09 2B 06 01 05 05 07 05 01 07"	= "Додатковий шаблон сертифіката";
"06 09 2B 06 01 05 05 07 05 01 08"	= "Шаблон WAP WTLS";

"06 08 2B 06 01 05 05 07 05 02"		= "Реєстраційні відомості CRMF";
"06 09 2B 06 01 05 05 07 05 02 01"	= "Пари UTF-8";
"06 09 2B 06 01 05 05 07 05 02 02"	= "Запит сертифіката";

"06 07 2B 06 01 05 05 07 06"		= "Алгоритми";
"06 08 2B 06 01 05 05 07 06 01"		= "DES-40";
"06 08 2B 06 01 05 05 07 06 02"		= "Немає підпису";
"06 08 2B 06 01 05 05 07 06 03"		= "dh-sig-hmac-sha1";
"06 08 2B 06 01 05 05 07 06 04"		= "dh-pop";

"06 07 2B 06 01 05 05 07 07"		= "Елементи керування CMC";

"06 07 2B 06 01 05 05 07 08"		= "Інші назви";
"06 08 2B 06 01 05 05 07 08 01"		= "Особисті дані";
"06 08 2B 06 01 05 05 07 08 02"		= "Група користувачів";

"06 07 2B 06 01 05 05 07 09"		= "Особисті дані";
"06 08 2B 06 01 05 05 07 09 01"		= "Дата народження";
"06 08 2B 06 01 05 05 07 09 02"		= "Місце народження
";
"06 08 2B 06 01 05 05 07 09 03"		= "Псевдонім";
"06 08 2B 06 01 05 05 07 09 04"		= "Стать";
"06 08 2B 06 01 05 05 07 09 05"		= "Громадянство";
"06 08 2B 06 01 05 05 07 09 06"		= "Країна проживання";

"06 07 2B 06 01 05 05 07 0A"		= "Сертифікат атрибута";
"06 08 2B 06 01 05 05 07 0A 01"		= "Дані автентифікації";
"06 08 2B 06 01 05 05 07 0A 02"		= "Цифровий підпис доступу";
"06 08 2B 06 01 05 05 07 0A 03"		= "Цифровий підпис тарифікації";
"06 08 2B 06 01 05 05 07 0A 04"		= "Група";
"06 08 2B 06 01 05 05 07 0A 05"		= "Посада";
"06 08 2B 06 01 05 05 07 0A 06"		= "WLAN SSID";

/* OCSP */

"06 08 2B 06 01 05 05 07 30 01"		= "Протокол стану сертифіката в мережі";
"06 09 2B 06 01 05 05 07 30 01 01"	= "Базова відповідь OCSP";
"06 09 2B 06 01 05 05 07 30 01 02"	= "Тимчасове розширення OCSP";
"06 09 2B 06 01 05 05 07 30 01 03"	= "Позначення СВС за OCSP";
"06 09 2B 06 01 05 05 07 30 01 04"	= "Відповідь OCSP";
"06 09 2B 06 01 05 05 07 30 01 05"	= "Без перевірки на відкликання OCSP";
"06 09 2B 06 01 05 05 07 30 01 06"	= "Термін зберігання в архіві OCSP";
"06 09 2B 06 01 05 05 07 30 01 07"	= "Локатор служби OCSP";

"06 08 2B 06 01 05 05 07 30 02"		= "Видавці ЦС";
"06 08 2B 06 01 05 05 07 30 03"		= "Додавання мітки часу";

/* ISAKMP */

"06 08 2B 06 01 05 05 08 01 01"		= "HMAC MD5";
"06 08 2B 06 01 05 05 08 01 02"		= "HMAC SHA-1";
"06 08 2B 06 01 05 05 08 01 03"		= "HMAC Tiger";
"06 08 2B 06 01 05 05 08 02 02"		= "Проміжний IKE";

/* DEC (via ECMA) */

"06 07 2B 0C 02 87 73 07 01"		= "Алгоритм шифрування DEC";
"06 08 2B 0C 02 87 73 07 01 02"		= "DEC DEA";
"06 07 2B 0C 02 87 73 07 02"		= "Хеш-алгоритм DEC";
"06 07 2B 0C 02 87 73 07 02 01"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 02 02"		= "DEC MD2";
"06 07 2B 0C 02 87 73 07 03"		= "Алгоритм підпису DEC";
"06 07 2B 0C 02 87 73 07 03 01"		= "DEC MD2 з RSA";
"06 07 2B 0C 02 87 73 07 03 02"		= "DEC MD4 з RSA";
"06 07 2B 0C 02 87 73 07 03 03"		= "DEC DEA-MAC";

/* NIST Open Systems Environment (OSE) Implementor's Workshop (OIW) */

"06 05 2B 0E 02 1A 05"				= "SHA";
"06 06 2B 0E 03 02 01 01"			= "RSA";
"06 05 2B 0E 03 02 02"				= "MD4 з RSA";
"06 05 2B 0E 03 02 03"				= "MD5 з RSA";
"06 05 2B 0E 03 02 04"				= "MD4 з шифруванням RSA";
"06 06 2B 0E 03 02 02 01"			= "SqMod-N";
"06 06 2B 0E 03 02 03 01"			= "SqMod-N з RSA";
"06 05 2B 0E 03 02 06"				= "DES-ECB";
"06 05 2B 0E 03 02 07"				= "DES-CBC";
"06 05 2B 0E 03 02 08"				= "DES-OFB";
"06 05 2B 0E 03 02 09"				= "DES-CFB";
"06 05 2B 0E 03 02 0A"				= "DES-MAC";
"06 05 2B 0E 03 02 0B"				= "Підпис RSA";
"06 05 2B 0E 03 02 0C"				= "DSA";
"06 05 2B 0E 03 02 0D"				= "DSA з SHA";
"06 05 2B 0E 03 02 0E"				= "MDC2 з підписом RSA";
"06 05 2B 0E 03 02 0F"				= "SHA з підписом RSA";
"06 05 2B 0E 03 02 10"				= "Загальна числова характеристика Деффі-Хеллмана";
"06 05 2B 0E 03 02 11"				= "DES-EDE";
"06 05 2B 0E 03 02 12"				= "SHA";
"06 05 2B 0E 03 02 13"				= "MDC-2";
"06 05 2B 0E 03 02 14"				= "Загальний DSA";
"06 05 2B 0E 03 02 15"				= "Загальний DSA з SHA";
"06 05 2B 0E 03 02 16"				= "Транспорт ключа RSA";
"06 05 2B 0E 03 02 17"				= "Keyed-hash-seal";
"06 05 2B 0E 03 02 18"				= "MD2 з підписом RSA";
"06 05 2B 0E 03 02 19"				= "MD5 з підписом RSA";
"06 05 2B 0E 03 02 1A"				= "SHA-1";
"06 05 2B 0E 03 02 1B"				= "DSA з SHA-1";
"06 05 2B 0E 03 02 1C"				= "DSA із загальним SHA-1";
"06 05 2B 0E 03 02 1D"				= "SHA-1 з шифруванням RSA";
"06 05 2B 0E 03 03 01"				= "Simple-strong-auth-mechanism";
"06 06 2B 0E 07 02 01 01"			= "ElGamal";
"06 06 2B 0E 07 02 03 01"			= "MD2 з RSA";
"06 06 2B 0E 07 02 03 02"			= "MD2 з ElGamal";

/* Teletrust */

"06 03 2B 24 01"					= "Документ";
"06 04 2B 24 01 01"					= "Версія файлу";
"06 04 2B 24 01 02"					= "Чернетка";
"06 03 2B 24 02"					= "SIO";
"06 04 2B 24 02 01"					= "SEDU";

"06 03 2B 24 03"					= "Алгоритм";
"06 04 2B 24 03 01"					= "Алгоритм шифрування";
"06 05 2B 24 03 01 01"				= "DES";
"06 06 2B 24 03 01 01 01"			= "Блокнот DES-ECB";
"06 07 2B 24 03 01 01 01 01"		= "Блокнот ISO DES-ECB";
"06 07 2B 24 03 01 01 02 01"		= "Блокнот DES-CBC";
"06 08 2B 24 03 01 01 02 01 01"		= "Блокнот ISO DES-CBC";
"06 05 2B 24 03 01 03"				= "DES3";
"06 07 2B 24 03 01 03 01 01"		= "Блокнот DES3-ECB";
"06 08 2B 24 03 01 03 01 01 01"		= "Блокнот ISO3 DES-ECB";
"06 07 2B 24 03 01 03 02 01"		= "Блокнот DES3-CBC";
"06 08 2B 24 03 01 03 02 01 01"		= "Блокнот ISO DES3-CBC";
"06 05 2B 24 03 01 02"				= "IDEA";
"06 06 2B 24 03 01 02 01"			= "IDEA-ECB";
"06 07 2B 24 03 01 02 01 01"		= "Блокнот IDEA-ECB";
"06 08 2B 24 03 01 02 01 01 01"		= "Блокнот ISO IDEA-ECB";
"06 06 2B 24 03 01 02 02"			= "IDEA-CBC";
"06 07 2B 24 03 01 02 02 01"		= "Блокнот IDEA-CBC";
"06 08 2B 24 03 01 02 02 01 01"		= "Блокнот ISO IDEA-CBC";
"06 06 2B 24 03 01 02 03"			= "IDEA-OFB";
"06 06 2B 24 03 01 02 04"			= "IDEA-CFB";
"06 05 2B 24 03 01 04"				= "Шифрування RSA";
"06 05 2B 24 03 01 05"				= "BSI-1";
"06 06 2B 24 03 01 05 01"			= "Блокнот BSI-1-ECB";
"06 06 2B 24 03 01 05 02"			= "Блокнот BSI-1-CBC";
"06 07 2B 24 03 01 05 02 01"		= "Блокнот PEM BSI-1-CBC";

"06 04 2B 24 03 02"					= "Хеш-алгоритм";
"06 05 2B 24 03 02 01"				= "RIPEMD-160";
"06 05 2B 24 03 02 02"				= "RIPEMD-128";
"06 05 2B 24 03 02 03"				= "RIPEMD-256";
"06 05 2B 24 03 02 04"				= "Одиночна довжина MDC2";
"06 05 2B 24 03 02 05"				= "Подвійна довжина MDC2";
"06 04 2B 24 03 03"					= "Алгоритм підпису";
"06 05 2B 24 03 03 01"				= "Підпис RSA";

"06 06 2B 24 03 03 01 01"			= "Підпис RSA з SHA-1";
"06 09 2B 24 03 03 01 01 84 00 02"	= "Підпис RSA з SHA-1 512/L2";
"06 09 2B 24 03 03 01 01 85 00 02"	= "Підпис RSA з SHA-1 640/L2";
"06 09 2B 24 03 03 01 01 86 00 02"	= "Підпис RSA з SHA-1 768/L2";
"06 09 2B 24 03 03 01 01 87 00 02"	= "Підпис RSA з SHA-1 896/L2";
"06 09 2B 24 03 03 01 01 88 00 02"	= "Підпис RSA з SHA-1 1024/L2";
"06 09 2B 24 03 03 01 01 84 00 03"	= "Підпис RSA з SHA-1 512/L3";
"06 09 2B 24 03 03 01 01 85 00 03"	= "Підпис RSA з SHA-1 640/L3";
"06 09 2B 24 03 03 01 01 86 00 03"	= "Підпис RSA з SHA-1 768/L3";
"06 09 2B 24 03 03 01 01 87 00 03"	= "Підпис RSA з SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 03"	= "Підпис RSA з SHA-1 1024/L3";
"06 09 2B 24 03 03 01 01 84 00 05"	= "Підпис RSA з SHA-1 512/L5";
"06 09 2B 24 03 03 01 01 85 00 05"	= "Підпис RSA з SHA-1 640/L5";
"06 09 2B 24 03 03 01 01 86 00 05"	= "Підпис RSA з SHA-1 768/L5";
"06 09 2B 24 03 03 01 01 87 00 05"	= "Підпис RSA з SHA-1 896/L5
";
"06 09 2B 24 03 03 01 01 88 00 05"	= "Підпис RSA з SHA-1 1024/L5";
"06 09 2B 24 03 03 01 01 84 00 09"	= "Підпис RSA з SHA-1 512/L9";
"06 09 2B 24 03 03 01 01 85 00 09"	= "Підпис RSA з SHA-1 640/L9";
"06 09 2B 24 03 03 01 01 86 00 09"	= "Підпис RSA з SHA-1 768/L9";
"06 09 2B 24 03 03 01 01 87 00 09"	= "Підпис RSA з SHA-1 896/L3";
"06 09 2B 24 03 03 01 01 88 00 09"	= "Підпис RSA з SHA-1 1024/L9";
"06 09 2B 24 03 03 01 01 84 00 11"	= "Підпис RSA з SHA-1 512/L11";
"06 09 2B 24 03 03 01 01 85 00 11"	= "Підпис RSA з SHA-1 640/L11";
"06 09 2B 24 03 03 01 01 86 00 11"	= "Підпис RSA з SHA-1 768/L11";
"06 09 2B 24 03 03 01 01 87 00 11"	= "Підпис RSA з SHA-1 896/L11";
"06 09 2B 24 03 03 01 01 88 00 11"	= "Підпис RSA з SHA-1 1024/L11";

"06 06 2B 24 03 03 01 02"			= "Підпис RSA з RIPEMD-160";
"06 09 2B 24 03 03 01 02 84 00 02"	= "Підпис RSA з RIPEMD-160 512/L2";
"06 09 2B 24 03 03 01 02 85 00 02"	= "Підпис RSA з RIPEMD-160 640/L2";
"06 09 2B 24 03 03 01 02 86 00 02"	= "Підпис RSA з RIPEMD-160 768/L2";
"06 09 2B 24 03 03 01 02 87 00 02"	= "Підпис RSA з RIPEMD-160 896/L2";
"06 09 2B 24 03 03 01 02 88 00 02"	= "Підпис RSA з RIPEMD-160 1024/L2";
"06 09 2B 24 03 03 01 02 84 00 03"	= "Підпис RSA з RIPEMD-160 512/L3";
"06 09 2B 24 03 03 01 02 85 00 03"	= "Підпис RSA з RIPEMD-160 640/L3";
"06 09 2B 24 03 03 01 02 86 00 03"	= "Підпис RSA з RIPEMD-160 768/L3";
"06 09 2B 24 03 03 01 02 87 00 03"	= "Підпис RSA з RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 03"	= "Підпис RSA з RIPEMD-160 1024/L3";
"06 09 2B 24 03 03 01 02 84 00 05"	= "Підпис RSA з RIPEMD-160 512/L5";
"06 09 2B 24 03 03 01 02 85 00 05"	= "Підпис RSA з RIPEMD-160 640/L5";
"06 09 2B 24 03 03 01 02 86 00 05"	= "Підпис RSA з RIPEMD-160 768/L5";
"06 09 2B 24 03 03 01 02 87 00 05"	= "Підпис RSA з RIPEMD-160 896/L3";
"06 09 2B 24 03 03 01 02 88 00 05"	= "Підпис RSA з RIPEMD-160 1024/L5";
"06 09 2B 24 03 03 01 02 84 00 09"	= "Підпис RSA з RIPEMD-160 512/L9";
"06 09 2B 24 03 03 01 02 85 00 09"	= "Підпис RSA з RIPEMD-160 640/L9";
"06 09 2B 24 03 03 01 02 86 00 09"	= "Підпис RSA з RIPEMD-160 768/L9";
"06 09 2B 24 03 03 01 02 87 00 09"	= "Підпис RSA з RIPEMD-160 896/L9";
"06 09 2B 24 03 03 01 02 88 00 09"	= "Підпис RSA з RIPEMD-160 1024/L9";
"06 09 2B 24 03 03 01 02 84 00 11"	= "Підпис RSA з RIPEMD-160 512/L11";
"06 09 2B 24 03 03 01 02 85 00 11"	= "Підпис RSA з RIPEMD-160 640/L11";
"06 09 2B 24 03 03 01 02 86 00 11"	= "Підпис RSA з RIPEMD-160 768/L11";
"06 09 2B 24 03 03 01 02 87 00 11"	= "Підпис RSA з RIPEMD-160 896/L11";
"06 09 2B 24 03 03 01 02 88 00 11"	= "Підпис RSA з RIPEMD-160 1024/L11";

"06 06 2B 24 03 03 01 03"			= "Підпис RSA з RIPEMD-128";
"06 06 2B 24 03 03 01 04"			= "Підпис RSA з RIPEMD-256";

"06 05 2B 24 03 03 02"				= "Підпис ECSIE";
"06 06 2B 24 03 03 02 01"			= "Підпис ECSIE з SHA-1";
"06 06 2B 24 03 03 02 02"			= "Підпис ECSIE з RIPEMD-160";
"06 06 2B 24 03 03 02 03"			= "Підпис ECSIE з MD2";
"06 06 2B 24 03 03 02 04"			= "Підпис ECSIE з MD5";

"06 04 2B 24 03 04"					= "Схема підпису";
"06 05 2B 24 03 04 01"				= "ISO9796-1";
"06 05 2B 24 03 04 02"				= "ISO9796-2";
"06 05 2B 24 03 04 02 01"			= "ISO9796-2 з RED";
"06 06 2B 24 03 04 02 02"			= "ISO9796-2 з RSA";
"06 06 2B 24 03 04 02 03"			= "ISO9796-2 з RND";

"06 03 2B 24 04"					= "Атрибут";
"06 03 2B 24 05"					= "Політика";
"06 03 2B 24 06"					= "ППІ";
"06 04 2B 24 06 01"					= "Виробник-Особий ППІ";
"06 05 2B 24 06 01 01"				= "UTIMACO-ППІ";
"06 04 2B 24 06 02"					= "ППІ певної функції";
"06 03 2B 24 07"					= "Керування ключами";
"06 04 2B 24 07 01"					= "Узгодження ключів";
"06 05 2B 24 07 01 01"				= "Криптографія з відкритим ключем BSI";
"06 04 2B 24 07 02"					= "Передавання ключа";
"06 05 2B 24 07 02 01"				= "ISO9796-2 з шифруванням RSA";

"06 05 2B 24 08 01 01"				= "Ідентифікатор політики SigiSigConform Teletrust";
"06 05 2B 24 08 02 01"				= "Служба каталогів";

"06 05 2B 24 08 03 01"				= "Дата створення сертифіката";
"06 05 2B 24 08 03 02"				= "Ведення справ за дорученням";
"06 05 2B 24 08 03 03"				= "Допуск";
"06 05 2B 24 08 03 04"				= "Грошове обмеження";
"06 05 2B 24 08 03 05"				= "Оголошення повноліття";
"06 05 2B 24 08 03 06"				= "Серійний номер смарт карти";
"06 05 2B 24 08 03 07"				= "Позначення відкритого ключа";
"06 05 2B 24 08 03 08"				= "Обмеження";
"06 05 2B 24 08 03 09"				= "Отримати за наявності дозволу";
"06 05 2B 24 08 03 0A"				= "Потрібний сертифікат";
"06 05 2B 24 08 03 0B"				= "Центри призначення імен";
"06 05 2B 24 08 03 0C"				= "Сертифікат у каталозі з";
"06 05 2B 24 08 03 0D"				= "Довільні дані сертифіката";

"06 05 2B 24 08 04 01"				= "Особисті дані";
"06 05 2B 24 08 04 08"				= "Обмеження";
"06 07 2B 24 08 05 01 01 01"		= "RSA Indicate SHA-1";
"06 07 2B 24 08 05 01 01 02"		= "RSA Indicate RIPEMD-160";
"06 07 2B 24 08 05 01 01 03"		= "RSA з SHA-1";
"06 07 2B 24 08 05 01 01 04"		= "RSA з RIPEMD-160";
"06 07 2B 24 08 05 01 02 01"		= "Розширений DSA";
"06 07 2B 24 08 05 01 02 02"		= "DSA з RIPEMD-160";

"06 05 2B 24 08 06 01"				= "Сертифікат";
"06 05 2B 24 08 06 02"				= "Позначення сертифіката";
"06 05 2B 24 08 06 03"				= "Сертифікат атрибута";
"06 05 2B 24 08 06 04"				= "Позначення атрибута";
"06 05 2B 24 08 06 05"				= "Ім’я файлу";
"06 05 2B 24 08 06 06"				= "Час зберігання";
"06 05 2B 24 08 06 07"				= "Розмір файлу";
"06 05 2B 24 08 06 08"				= "Розташування";
"06 05 2B 24 08 06 09"				= "Номер підпису";
"06 05 2B 24 08 06 0A"				= "Автоматично створений";

"06 05 2B 24 08 07 01"				= "Типи презентацій Teletrust";
"06 06 2B 24 08 07 01 01"			= "Adobe Illustrator";
"06 06 2B 24 08 07 01 02"			= "AmiPro";
"06 06 2B 24 08 07 01 03"			= "AutoCAD";
"06 06 2B 24 08 07 01 04"			= "Бінарний";
"06 06 2B 24 08 07 01 05"			= "BMP";
"06 06 2B 24 08 07 01 06"			= "CGM";
"06 06 2B 24 08 07 01 07"			= "CorelCRT";
"06 06 2B 24 08 07 01 08"			= "CorelDRW";
"06 06 2B 24 08 07 01 09"			= "CorelEXC";
"06 06 2B 24 08 07 01 0A"			= "CorelPHT";
"06 06 2B 24 08 07 01 0B"			= "Отримати відомості";
"06 06 2B 24 08 07 01 0C"			= "DVI";
"06 06 2B 24 08 07 01 0D"			= "EPS";
"06 06 2B 24 08 07 01 0E"			= "Excel";
"06 06 2B 24 08 07 01 0F"			= "GEM";
"06 06 2B 24 08 07 01 10"			= "GIF";
"06 06 2B 24 08 07 01 11"			= "HPGL";
"06 06 2B 24 08 07 01 12"			= "JPEG";
"06 06 2B 24 08 07 01 13"			= "Kodak";
"06 06 2B 24 08 07 01 14"			= "LaTeX";
"06 06 2B 24 08 07 01 15"			= "Lotus";
"06 06 2B 24 08 07 01 16"			= "LotusPIC";
"06 06 2B 24 08 07 01 17"			= "MacPICT";
"06 06 2B 24 08 07 01 18"			= "MacWord";
"06 06 2B 24 08 07 01 19"			= "MSWfD";
"06 06 2B 24 08 07 01 1A"			= "MSWord";
"06 06 2B 24 08 07 01 1B"			= "MSWord2";
"06 06 2B 24 08 07 01 1C"			= "MSWord6";
"06 06 2B 24 08 07 01 1D"			= "MSWord8";
"06 06 2B 24 08 07 01 1E"			= "PDF";
"06 06 2B 24 08 07 01 1F"			= "PIF";
"06 06 2B 24 08 07 01 20"			= "Postscript";
"06 06 2B 24 08 07 01 21"			= "RTF";
"06 06 2B 24 08 07 01 22"			= "SCITEX";
"06 06 2B 24 08 07 01 23"			= "TAR";
"06 06 2B 24 08 07 01 24"			= "Targa";
"06 06 2B 24 08 07 01 25"			= "TeX";
"06 06 2B 24 08 07 01 26"			= "Текст";
"06 06 2B 24 08 07 01 27"			= "TIFF";
"06 06 2B 24 08 07 01 28"			= "TIFF-FC";
"06 06 2B 24 08 07 01 29"			= "UID";
"06 06 2B 24 08 07 01 2A"			= "UUEncode";
"06 06 2B 24 08 07 01 2B"			= "WMF";
"06 06 2B 24 08 07 01 2C"			= "WordPerfect";
"06 06 2B 24 08 07 01 2D"			= "WPGrph";

/* Thawte */

"06 04 2B 65 01 04"					= "Розширення сертифіката Thawte";
"06 05 2B 65 01 04 01"				= "Захищена екстрамережа";

/* X.520 */

"06 02 55 04"		= "Типи атрибутів X.520";
"06 03 55 04 00"	= "Клас об’єкта";
"06 03 55 04 01"	= "Псевдонім для входу";
"06 03 55 04 02"	= "Інформація про тип знань";
"06 03 55 04 03"	= "Загальна назва";
"06 03 55 04 04"	= "Прізвище";
"06 03 55 04 05"	= "Серійний номер";
"06 03 55 04 06"	= "Назва країни";
"06 03 55 04 07"	= "Назва місцевості";
"06 04 55 04 07 01"	= "Загальна назва місцевості";
"06 03 55 04 08"	= "Назва країни або області";
"06 04 55 04 08 01"	= "Загальна назва країни або області";
"06 03 55 04 09"	= "Вулиця";
"06 04 55 04 09 01"	= "Загальна вулиця";
"06 03 55 04 0A"	= "Назва організації";
"06 04 55 04 0A 01"	= "Загальна назва організації";
"06 03 55 04 0B"	= "Назва підрозділу організації";
"06 04 55 04 0B 01"	= "Загальна назва підрозділу організації";
"06 03 55 04 0C"	= "Назва";
"06 03 55 04 0D"	= "Опис";
"06 03 55 04 0E"	= "Посібник із пошуку";
"06 03 55 04 0F"	= "Категорія діяльності";
"06 03 55 04 10"	= "Поштова адреса";
"06 04 55 04 10 01"	= "Загальна поштова адреса";
"06 03 55 04 11"	= "Індекс";
"06 04 55 04 11 01"	= "Загальний поштовий індекс";
"06 03 55 04 12"	= "Абонентська скринька";
"06 04 55 04 12 01"	= "Загальна абонентська скринька";
"06 03 55 04 13"	= "Назва офісу для фактичної доставки";
"06 04 55 04 13 01"	= "Загальна назва офісу для фактичної доставки";
"06 03 55 04 14"	= "Телефонний номер";
"06 04 55 04 14 01"	= "Загальний номер телефону";
"06 03 55 04 15"	= "Номер Telex";
"06 04 55 04 15 01"	= "Загальний номер телекса";
"06 03 55 04 16"	= "Ідентифікатор термінала Teletex";
"06 04 55 04 16 01"	= "Загальний ідентифікатор термінала телетекса";
"06 03 55 04 17"	= "Номер факсу";
"06 04 55 04 17 01"	= "Загальний номер факсу";
"06 03 55 04 18"	= "Адреса X.121";
"06 03 55 04 19"	= "Міжнародний ISDN-номер";
"06 04 55 04 19 01"	= "Загальний міжнародний ISDN-номер";
"06 03 55 04 1A"	= "Зареєстрована адреса";
"06 03 55 04 1B"	= "Індикатор пункту призначення";
"06 03 55 04 1C"	= "Пріоритетний спосіб доставки";
"06 03 55 04 1D"	= "Адреса представництва";
"06 03 55 04 1E"	= "Підтримуваний прикладний контекст";
"06 03 55 04 1F"	= "Учасник";
"06 03 55 04 20"	= "Власник";
"06 03 55 04 21"	= "Посадовець";
"06 03 55 04 22"	= "Дивись також";
"06 03 55 04 23"	= "Пароль користувача";
"06 03 55 04 24"	= "Сертифікат користувача";
"06 03 55 04 25"	= "Сертифікат ЦС";
"06 03 55 04 26"	= "Список відкликання повноважень";
"06 03 55 04 27"	= "Список відкликання сертифікатів";
"06 03 55 04 28"	= "Перехресна пара сертифікатів";
"06 03 55 04 29"	= "Ім’я";
"06 03 55 04 2A"	= "Ім’я";
"06 03 55 04 2B"	= "Ініціали";
"06 03 55 04 2C"	= "Кваліфікатор покоління";
"06 03 55 04 2D"	= "Унікальний ідентифікатор";
"06 03 55 04 2E"	= "Кваліфікатор DN";
"06 03 55 04 2F"	= "Посібник із вдосконаленого пошуку";
"06 03 55 04 30"	= "Відомості про протокол
";
"06 03 55 04 31"	= "Унікальне ім’я";
"06 03 55 04 32"	= "Унікальний учасник";
"06 03 55 04 33"	= "Ідентифікатор будинку";
"06 03 55 04 34"	= "Підтримувані алгоритми";
"06 03 55 04 35"	= "Дельта-список відкликання";
"06 03 55 04 36"	= "Дозвіл";
"06 03 55 04 3A"	= "Перехресна пара сертифікатів";

/* X.500 object classes */

"06 02 55 06"		= "Клас об’єктів X.520";
"06 03 55 06 00"	= "Зверху";
"06 03 55 06 01"	= "Псевдонім";
"06 03 55 06 02"	= "Країна";
"06 03 55 06 03"	= "Місцевість";
"06 03 55 06 04"	= "Організація";
"06 03 55 06 05"	= "Підрозділ організації";
"06 03 55 06 06"	= "Особа";
"06 03 55 06 07"	= "Співробітник організації";
"06 03 55 06 08"	= "Посада в організації";
"06 03 55 06 09"	= "Група імен";
"06 03 55 06 0A"	= "Приватна особа";
"06 03 55 06 0B"	= "Прикладний процес";
"06 03 55 06 0C"	= "Прикладний компонент";
"06 03 55 06 0D"	= "DSA";
"06 03 55 06 0E"	= "Пристрій";
"06 03 55 06 0F"	= "Користувач захищеної автентифікації";
"06 03 55 06 10"	= "Центр сертифікації";
"06 03 55 06 11"	= "Група унікальних імен";
"06 03 55 06 15"	= "Користувач PKI";
"06 03 55 06 16"	= "ЦС PKI";

/* X.500 algorithms */

"06 02 55 08"		= "Алгоритми X.500";
"06 03 55 08 01"	= "Алгоритми шифрування X.500";
"06 04 55 08 01 01"	= "RSA";

/* X.509 */

"06 02 55 1D"		= "Розширення сертифікатів X.509";
"06 03 55 1D 01"	= "Ідентифікатор ключа повноважень (старий)";
"06 03 55 1D 02"	= "Атрибути старого ключа (старі)";
"06 03 55 1D 03"	= "Політики сертифікатів (старі)";
"06 03 55 1D 04"	= "Обмеження щодо використання ключа (старі)";
"06 03 55 1D 05"	= "Перетворення політики (стара версія)";
"06 03 55 1D 06"	= "Обмеження вкладених структур";
"06 03 55 1D 07"	= "Додаткова тема (стара)";
"06 03 55 1D 08"	= "Додаткове ім’я видавця (стара версія)";
"06 03 55 1D 09"	= "Атрибути каталога теми";
"06 03 55 1D 0A"	= "Чільні обмеження (стара версія 2.5.29.10)";
"06 03 55 1D 0B"	= "Обмеження імен (старі)";
"06 03 55 1D 0C"	= "Обмеження політики (старі)";
"06 03 55 1D 0D"	= "Чільні обмеження (стара версія 2.5.29.13)";
"06 03 55 1D 0E"	= "Ідентифікатор ключа теми";
"06 03 55 1D 0F"	= "Використання ключа";
"06 03 55 1D 10"	= "Термін використання особистого ключа";
"06 03 55 1D 11"	= "Додаткова тема";
"06 03 55 1D 12"	= "Додаткове ім’я видавця";
"06 03 55 1D 13"	= "Чільні обмеження";
"06 03 55 1D 14"	= "Номер списоку відкликання сертифікатів";
"06 03 55 1D 15"	= "Код причини СВС";
"06 03 55 1D 16"	= "Дата завершення дії (стара)";
"06 03 55 1D 17"	= "Код інструкції утримання";
"06 03 55 1D 18"	= "Дата завершення терміну дії";
"06 03 55 1D 19"	= "Точки розподілу СВС (старі)";
"06 03 55 1D 1A"	= "Точка розподілу (стара версія)";
"06 03 55 1D 1B"	= "Дельта-індикатор СВС";
"06 03 55 1D 1C"	= "Точка розподілу";
"06 03 55 1D 1D"	= "Видавець сертифіката";
"06 03 55 1D 1E"	= "Обмеження імен";
"06 03 55 1D 1F"	= "Точки розподілу СВС";
"06 03 55 1D 20"	= "Політики сертифікатів";
"06 04 55 1D 20 00"	= "Будь-який ідентифікатор політики";
"06 03 55 1D 21"	= "Перетворення політик";
"06 03 55 1D 22"	= "Обмеження політики";
"06 03 55 1D 23"	= "Ідентифікатор ключа повноважень";
"06 03 55 1D 24"	= "Обмеження політики";
"06 03 55 1D 25"	= "Використання розширеного ключа";
"06 04 55 1D 25 00"	= "Використання будь-якого розширеного ключа";

/* DMS - SDN.700 INFOSEC algorithms */

"06 09 60 86 48 01 65 02 01 01 01"	= "Алгоритм безпеки SDNS";
"06 09 60 86 48 01 65 02 01 01 02"	= "Алгоритм підпису Fortezza";
"06 09 60 86 48 01 65 02 01 01 03"	= "Алгоритм конфіденційності SDNS";
"06 09 60 86 48 01 65 02 01 01 04"	= "Алгоритм конфіденційності Fortezza";
"06 09 60 86 48 01 65 02 01 01 05"	= "Алгоритм цілісності SDNS";
"06 09 60 86 48 01 65 02 01 01 06"	= "Алгоритм цілісності Fortezza";
"06 09 60 86 48 01 65 02 01 01 07"	= "Алгоритм захисту коду SDNS";
"06 09 60 86 48 01 65 02 01 01 08"	= "Алгоритм захисту коду Fortezza";
"06 09 60 86 48 01 65 02 01 01 09"	= "Алгоритм керування ключами SDNS";
"06 09 60 86 48 01 65 02 01 01 0A"	= "Алгоритм керування ключами Fortezza";
"06 09 60 86 48 01 65 02 01 01 0B"	= "Алгоритм керування ключами і підпису SDNS";
"06 09 60 86 48 01 65 02 01 01 0C"	= "Алгоритм підпису та керування ключами Fortezza";
"06 09 60 86 48 01 65 02 01 01 0D"	= "Алгоритм підпису Suite A";
"06 09 60 86 48 01 65 02 01 01 0E"	= "Алгоритм конфіденційності Suite A ";
"06 09 60 86 48 01 65 02 01 01 0F"	= "Алгоритм цілісності Suite A";
"06 09 60 86 48 01 65 02 01 01 10"	= "Алгоритм захисту коду Suite A";
"06 09 60 86 48 01 65 02 01 01 11"	= "Алгоритм керування ключами Suite A";
"06 09 60 86 48 01 65 02 01 01 12"	= "Алгоритм керування ключами і підпису Suite A";
"06 09 60 86 48 01 65 02 01 01 13"	= "Алгоритм оновленого підпису Fortezza";
"06 09 60 86 48 01 65 02 01 01 14"	= "Алгоритми оновлених підписів та керування ключами Fortezza";
"06 09 60 86 48 01 65 02 01 01 15"	= "Алгоритм оновленої цілісності Fortezza";
"06 09 60 86 48 01 65 02 01 01 16"	= "Алгоритм обміну ключами";
"06 09 60 86 48 01 65 02 01 01 17"	= "Алгоритм Wrap80 Fortezza";
"06 09 60 86 48 01 65 02 01 01 18"	= "Алгоритм шифрування ключа (KEA)";

"06 09 60 86 48 01 65 02 01 02 01"	= "Формат повідомлення RFC 822";
"06 09 60 86 48 01 65 02 01 02 02"	= "Пустий вміст";
"06 09 60 86 48 01 65 02 01 02 03"	= "Тип вмісту CSP";
"06 09 60 86 48 01 65 02 01 02 2A"	= "Тип вмісту MSP Rev 3";
"06 09 60 86 48 01 65 02 01 02 30"	= "Тип вмісту MSP";
"06 09 60 86 48 01 65 02 01 02 31"	= "Протокол агента MSP Rekey";
"06 09 60 86 48 01 65 02 01 02 32"	= "MSP MMP";
"06 09 60 86 48 01 65 02 01 02 42"	= "Тип вмісту MSP Rev 3.1";
"06 09 60 86 48 01 65 02 01 02 48"	= "Частина тіла переадресованого повідомлення MSP";
"06 09 60 86 48 01 65 02 01 02 49"	= "Параметри переадресованого повідомлення MSP";
"06 09 60 86 48 01 65 02 01 02 50"	= "Частина тіла переадресованого повідомлення CSP";
"06 09 60 86 48 01 65 02 01 02 51"	= "Параметри переадресованого повідомлення CSP";
"06 09 60 86 48 01 65 02 01 02 52"	= "MSP MMP2";

/* SDN.700 INFOSEC policy */

"06 09 60 86 48 01 65 02 01 03 01"		= "Політика безпеки SDNS";
"06 09 60 86 48 01 65 02 01 03 02"		= "SDNS PRBAC";
"06 09 60 86 48 01 65 02 01 03 03"		= "Mosaic PRBAC";

"06 09 60 86 48 01 65 02 01 03 0A"		= "Політика безпеки";
"06 0A 60 86 48 01 65 02 01 03 0A 00"	= "NASP";
"06 0A 60 86 48 01 65 02 01 03 0A 01"	= "ELCO";
"06 0A 60 86 48 01 65 02 01 03 0A 02"	= "TK";
"06 0A 60 86 48 01 65 02 01 03 0A 03"	= "DSAP";
"06 0A 60 86 48 01 65 02 01 03 0A 04"	= "SSSS";
"06 0A 60 86 48 01 65 02 01 03 0A 05"	= "DNASP";
"06 0A 60 86 48 01 65 02 01 03 0A 06"	= "BYEMAN";
"06 0A 60 86 48 01 65 02 01 03 0A 07"	= "REL-US";
"06 0A 60 86 48 01 65 02 01 03 0A 08"	= "REL-AUS";
"06 0A 60 86 48 01 65 02 01 03 0A 09"	= "REL-CAN";
"06 0A 60 86 48 01 65 02 01 03 0A 0A"	= "REL-UK";
"06 0A 60 86 48 01 65 02 01 03 0A 0B"	= "REL-NZ";
"06 0A 60 86 48 01 65 02 01 03 0A 0C"	= "Базовий";

"06 09 60 86 48 01 65 02 01 03 0B"			= "genser";
"06 0A 60 86 48 01 65 02 01 03 0B 00"		= "genserNations";
"06 0A 60 86 48 01 65 02 01 03 0B 01"		= "genserComsec";
"06 0A 60 86 48 01 65 02 01 03 0B 02"		= "genserAcquisition";
"06 0A 60 86 48 01 65 02 01 03 0B 03"		= "genserSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0B 03 00"	= "genserTagSetName";

"06 09 60 86 48 01 65 02 01 03 0C"			= "Стандартна політика безпеки";
"06 09 60 86 48 01 65 02 01 03 0D"			= "capcoMarkings";
"06 0A 60 86 48 01 65 02 01 03 0D 00"		= "capcoSecurityCategories";
"06 0B 60 86 48 01 65 02 01 03 0D 00 01"	= "capcoTagSetName1";
"06 0B 60 86 48 01 65 02 01 03 0D 00 02"	= "capcoTagSetName2";
"06 0B 60 86 48 01 65 02 01 03 0D 00 03"	= "capcoTagSetName3";
"06 0B 60 86 48 01 65 02 01 03 0D 00 04"	= "capcoTagSetName4";

"06 09 60 86 48 01 65 02 01 05 01"	= "Сертифікат керування ключами SDNS";
"06 09 60 86 48 01 65 02 01 05 02"	= "Сертифікат підпису користувача SDNS";
"06 09 60 86 48 01 65 02 01 05 03"	= "Сертифікат підпису та керування ключами SDNS";
"06 09 60 86 48 01 65 02 01 05 04"	= "Сертифікат керування ключами Fortezza";
"06 09 60 86 48 01 65 02 01 05 05"	= "Сертифікат підпису та керування ключами Fortezza";
"06 09 60 86 48 01 65 02 01 05 06"	= "Сертифікат підпису користувача Fortezza";
"06 09 60 86 48 01 65 02 01 05 07"	= "Сертифікат підпису ЦС Fortezza";
"06 09 60 86 48 01 65 02 01 05 08"	= "Сертифікат підпису ЦС SDNS";
"06 09 60 86 48 01 65 02 01 05 0A"	= "Допоміжний вектор";
"06 09 60 86 48 01 65 02 01 05 0B"	= "Політика отримання";
"06 09 60 86 48 01 65 02 01 05 0C"	= "Участь";
"06 09 60 86 48 01 65 02 01 05 0D"	= "Адміністратори";
"06 09 60 86 48 01 65 02 01 05 0E"	= "alid";
"06 09 60 86 48 01 65 02 01 05 14"	= "janUKMs";
"06 09 60 86 48 01 65 02 01 05 15"	= "febUKMs";
"06 09 60 86 48 01 65 02 01 05 16"	= "marUKMs";
"06 09 60 86 48 01 65 02 01 05 17"	= "aprUKMs";
"06 09 60 86 48 01 65 02 01 05 18"	= "mayUKMs";
"06 09 60 86 48 01 65 02 01 05 19"	= "junUKMs";
"06 09 60 86 48 01 65 02 01 05 1A"	= "julUKMs";
"06 09 60 86 48 01 65 02 01 05 1B"	= "augUKMs";
"06 09 60 86 48 01 65 02 01 05 1C"	= "sepUKMs";
"06 09 60 86 48 01 65 02 01 05 1D"	= "octUKMs";
"06 09 60 86 48 01 65 02 01 05 1E"	= "novUKMs";
"06 09 60 86 48 01 65 02 01 05 1F"	= "decUKMs";

"06 09 60 86 48 01 65 02 01 05 28"	= "Meta SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 29"	= "SDNS CKL";
"06 09 60 86 48 01 65 02 01 05 2A"	= "Підпис CKL Meta SDNS";
"06 09 60 86 48 01 65 02 01 05 2B"	= "Підпикс CKL SDNS";
"06 09 60 86 48 01 65 02 01 05 2C"	= "Список відкликань сертифікатів SDNS";
"06 09 60 86 48 01 65 02 01 05 2D"	= "Список відкликання сертифікатів Fortezza";
"06 09 60 86 48 01 65 02 01 05 2E"	= "Fortezza CKL";
"06 09 60 86 48 01 65 02 01 05 2F"	= "Обробник вилучених даних";
"06 09 60 86 48 01 65 02 01 05 30"	= "Охорона";
"06 09 60 86 48 01 65 02 01 05 31"	= "Підтримувані алгоритми";
"06 09 60 86 48 01 65 02 01 05 32"	= "Сертифікат керування ключами Suite A";
"06 09 60 86 48 01 65 02 01 05 33"	= "Сертифікат керування ключами і підписку Suite A";
"06 09 60 86 48 01 65 02 01 05 34"	= "Сертифікат підпису користувача Suite A";
"06 09 60 86 48 01 65 02 01 05 35"	= "Відомості PRBAC";
"06 09 60 86 48 01 65 02 01 05 36"	= "Обмеження ЦС PRBAC";
"06 09 60 86 48 01 65 02 01 05 37"	= "Привілеї підпису або керування ключами";
"06 09 60 86 48 01 65 02 01 05 38"	= "Загальні привілеї";
"06 09 60 86 48 01 65 02 01 05 39"	= "Атрибут з ярликом";
"06 09 60 86 48 01 65 02 01 05 3A"	= "Файл з відомостями про політику";
"06 09 60 86 48 01 65 02 01 05 3B"	= "Файл із відомостями про політику безпеки";
"06 09 60 86 48 01 65 02 01 05 3C"	= "Обмеження на дозвіл ЦС";

"06 09 60 86 48 01 65 02 01 07 01"		= "Розширення CSP";
"06 0A 60 86 48 01 65 02 01 07 01 00"	= "cspCsExtn";
"06 09 60 86 48 01 65 02 01 08 01"		= "Категорії захисту ISSI";
"06 09 60 86 48 01 65 02 01 08 02"		= "Стандартні привілеї ярлика безпеки";

"06 09 60 86 48 01 65 02 01 0A 01"			= "Привілеї підпису";
"06 09 60 86 48 01 65 02 01 0A 02"			= "Привілеї керування ключами";
"06 09 60 86 48 01 65 02 01 0A 03"			= "Привілей набору тегів імен";
"06 09 60 86 48 01 65 02 01 0B 01"			= "UK Demo";
"06 09 60 86 48 01 65 02 01 0B 02"			= "Міністерство оборони США Class 2";
"06 09 60 86 48 01 65 02 01 0B 03"			= "US Medium Pilot";
"06 09 60 86 48 01 65 02 01 0B 04"			= "Міністерство оборони США Class 4";
"06 09 60 86 48 01 65 02 01 0B 05"			= "Міністерство оборони США Class 3";
"06 09 60 86 48 01 65 02 01 0B 06"			= "Міністерство оборони США Class 5";
"06 09 60 86 48 01 65 02 01 0B 09"			= "Міністерство оборони США PKI Class 3";

"06 09 60 86 48 01 65 02 01 0C 00"			= "Тестова політика безпеки";
"06 0A 60 86 48 01 65 02 01 0C 00 01"		= "TSP1";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00"	= "TSP1 SecurityCategories";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 00"	= "TSP1 набір тегів нуль";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 01"	= "TSP1 набір тегів один";
"06 0B 60 86 48 01 65 02 01 0C 00 01 00 02"	= "TSP1 набір тегів два";
"06 0A 60 86 48 01 65 02 01 0C 00 02"		= "TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00"	= "Категорії безпеки TSP2";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 00"	= "TSP2 набір тегів нуль";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 01"	= "TSP2 набір тегів один";
"06 0B 60 86 48 01 65 02 01 0C 00 02 00 02"	= "TSP2 набір тегів два";

"06 0A 60 86 48 01 65 02 01 0C 00 03"		= "Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00"	= "Категорії безпеки Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 01"	= "Ім’я 1 набору тегів Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 02"	= "Ім’я 2 набору тегів Kafka";
"06 0B 60 86 48 01 65 02 01 0C 00 03 00 03"	= "Ім’я 3 набору тегів Kafka";

"06 0A 60 86 48 01 65 02 01 0C 01 01"		= "TCP1";
"06 09 60 86 48 01 65 02 01 0C 02"			= "Тестовий запис СВС";

/* CSOR GAK-FIPS */

"06 07 60 86 48 01 65 03 01"			= "Ярлик";
"06 07 60 86 48 01 65 03 02"			= "PKI";
"06 08 60 86 48 01 65 03 02 01"			= "Ідентифікатор політики GAK";
"06 0A 60 86 48 01 65 03 02 01 03 01"	= "Ідентифікатор рудиментарної політики FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 02"	= "Ідентифікатор базової політики FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 03"	= "Ідентифікатор середньої політики FBCA";
"06 0A 60 86 48 01 65 03 02 01 03 04"	= "Ідентифікатор високої політики FBCA";
"06 08 60 86 48 01 65 03 02 02"			= "GAK";
"06 09 60 86 48 01 65 03 02 02 01"		= "Ключ KRA";
"06 08 60 86 48 01 65 03 02 03"			= "Розширення";
"06 09 60 86 48 01 65 03 02 03 01"		= "Методика відновлення ключів";
"06 09 60 86 48 01 65 03 02 03 02"		= "Спроможний до відновлення ключа";
"06 09 60 86 48 01 65 03 02 03 03"		= "Відновлення ключа";
"06 08 60 86 48 01 65 03 02 04"			= "Схеми відновлення ключів";
"06 08 60 86 48 01 65 03 02 05"			= "Розширення CSOR GAK";
"06 07 60 86 48 01 65 03 03"			= "ARPA";

/* CSOR (NIST) Algorithms */

"06 07 60 86 48 01 65 03 04"			= "Алгоритм NIST";
"06 08 60 86 48 01 65 03 04 01"			= "AES";
"06 09 60 86 48 01 65 03 04 01 01"		= "AES 128-ECB";
"06 09 60 86 48 01 65 03 04 01 02"		= "AES 128-CBC";
"06 09 60 86 48 01 65 03 04 01 03"		= "AES 128-OFB";
"06 09 60 86 48 01 65 03 04 01 04"		= "AES 128-CFB";
"06 09 60 86 48 01 65 03 04 01 15"		= "AES 192-ECB";
"06 09 60 86 48 01 65 03 04 01 16"		= "AES 192-CBC";
"06 09 60 86 48 01 65 03 04 01 17"		= "AES 192-OFB";
"06 09 60 86 48 01 65 03 04 01 18"		= "AES 192-CFB";
"06 09 60 86 48 01 65 03 04 01 29"		= "AES 256-ECB";
"06 09 60 86 48 01 65 03 04 01 2A"		= "AES 256-CBC";
"06 09 60 86 48 01 65 03 04 01 2B"		= "AES 256-OFB";
"06 09 60 86 48 01 65 03 04 01 2C"		= "AES 256-CFB";

/* NIST secure hash algorithms */

"06 08 60 86 48 01 65 03 04 02"         = "SHA";
"06 09 60 86 48 01 65 03 04 02 01"      = "SHA-256";
"06 09 60 86 48 01 65 03 04 02 02"      = "SHA-384";
"06 09 60 86 48 01 65 03 04 02 03"      = "SHA-512";
"06 09 60 86 48 01 65 03 04 02 04"      = "SHA-224";

/* Novell */

"06 0A 60 86 48 01 86 F8 37 01 02 08"		= "Алгоритм Novell";
"06 0B 60 86 48 01 86 F8 37 01 02 08 16"	= "DES-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 17"	= "Блокнот IV8 DES-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 18"	= "DES-EDE2-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 19"	= "Блокнот IV8 DES-EDE2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1A"	= "DES-EDE3-CBC IV8";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1B"	= "Блокнот IV8 DES-EDE3-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1C"	= "Блокнот RC5-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1D"	= "MD2 з шифруванням RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1E"	= "MD5 з шифруванням RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 1F"	= "SHA-1 з шифруванням RSA BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 20"	= "Дайджест LM";
"06 0B 60 86 48 01 86 F8 37 01 02 08 28"	= "MD2";
"06 0B 60 86 48 01 86 F8 37 01 02 08 32"	= "MD5";
"06 0B 60 86 48 01 86 F8 37 01 02 08 33"	= "IKE HMAC з SHA1-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 34"	= "IKE HMAC з MD5-RSA";
"06 0B 60 86 48 01 86 F8 37 01 02 08 45"	= "Блокнот RC2-CBC";
"06 0B 60 86 48 01 86 F8 37 01 02 08 52"	= "SHA-1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5C"	= "RC2-CBC BSAFE1";
"06 0B 60 86 48 01 86 F8 37 01 02 08 5F"	= "MD4";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 02"	= "Пакет MD4";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 03"	= "Шифрування RSA BSAFE1";
"06 0C 60 86 48 01 86 F8 37 01 02 08 81 04"	= "Пароль NW";
"06 0B 60 86 48 01 86 F8 37 01 02 08 81 05"	= "Novell Obfuscate-1";

"06 09 60 86 48 01 86 F8 37 01 09"			= "PKI";
"06 0A 60 86 48 01 86 F8 37 01 09 04"		= "Тип атрибута PKI";
"06 0B 60 86 48 01 86 F8 37 01 09 04 01"	= "Атрибути безпеки";
"06 0B 60 86 48 01 86 F8 37 01 09 04 02"	= "Обмеження надійності";

/* Netscape */

"06 07 60 86 48 01 86 F8 42"		= "Ідентифікатор об’єкта Netscape";
"06 08 60 86 48 01 86 F8 42 01"		= "Розширення сертифіката Netscape ";
"06 09 60 86 48 01 86 F8 42 01 01"	= "Тип сертифіката Netscape";
"06 09 60 86 48 01 86 F8 42 01 02"	= "Базова URL-адреса Netscape";
"06 09 60 86 48 01 86 F8 42 01 03"	= "URL-адреса відкликання Netscape";
"06 09 60 86 48 01 86 F8 42 01 04"	= "URL-адреса відкликання ЦС Netscape";
"06 09 60 86 48 01 86 F8 42 01 05"	= "URL-адреса завантаження СВС Netscape";
"06 09 60 86 48 01 86 F8 42 01 06"	= "URL-адреса для завантаження сертифікатів ЦС Netscape";
"06 09 60 86 48 01 86 F8 42 01 07"	= "URL-адреса оновлення сертифікатів Netscape";
"06 09 60 86 48 01 86 F8 42 01 08"	= "URL-адреса політики ЦС Netscape";
"06 09 60 86 48 01 86 F8 42 01 09"	= "URL-адреса домашньої сторінки сертифікатів Netscape";
"06 09 60 86 48 01 86 F8 42 01 0A"	= "Логотип об’єкта сертифіката Netscape";
"06 09 60 86 48 01 86 F8 42 01 0B"	= "Зображення користувача сертифіката Netscape";
"06 09 60 86 48 01 86 F8 42 01 0C"	= "Ім’я SSL-сервера Netscape";
"06 09 60 86 48 01 86 F8 42 01 0D"	= "Коментар про сертифікат Netscape";

"06 08 60 86 48 01 86 F8 42 02"		= "Тип даних Netscape";
"06 09 60 86 48 01 86 F8 42 02 01"	= "зображення/GIF";
"06 09 60 86 48 01 86 F8 42 02 02"	= "зображення/JPEG";
"06 09 60 86 48 01 86 F8 42 02 03"	= "URL-адреса";
"06 09 60 86 48 01 86 F8 42 02 04"	= "текст/HTML";

"06 09 60 86 48 01 86 F8 42 02 05"	= "Послідовність сертифікатів Netscape";
"06 09 60 86 48 01 86 F8 42 02 06"	= "URL-адреса сертифіката Netscape";

"06 08 60 86 48 01 86 F8 42 03"			= "Ідентифікатор об’єкта каталога Netscape";
"06 09 60 86 48 01 86 F8 42 03 01"		= "Визначення LDAP";
"06 0A 60 86 48 01 86 F8 42 03 01 01"	= "Номер автомобіля";
"06 0A 60 86 48 01 86 F8 42 03 01 02"	= "Номер віддлу";
"06 0A 60 86 48 01 86 F8 42 03 01 03"	= "Номер працівника";
"06 0A 60 86 48 01 86 F8 42 03 01 04"	= "Тип працівника";
"06 0A 60 86 48 01 86 F8 42 03 02 02"	= "Особа, пов’язана з організацією";

"06 09 60 86 48 01 86 F8 42 04 01"		= "Server Gated Crypto";

/* Verisign */

/* Country, zip, date of birth (age), and gender of cert owner (CZAG) in obfuscated form */
"06 0A 60 86 48 01 86 F8 45 01 06 03"	= "Verisign CZAG";

/* Text string used in certs issued to Netscape InBox customers */
"06 0A 60 86 48 01 86 F8 45 01 06 06"	= "Verisign InBox";

"06 0A 60 86 48 01 86 F8 45 01 06 0B"	= "Невідоме розширення Verisign VPN";
"06 0A 60 86 48 01 86 F8 45 01 06 0D"	= "Невідоме розширення Verisign VPN";

"06 0B 60 86 48 01 86 F8 45 01 07 01 01"	= "Ідентифікатор політики Verisign";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 01"	= "Примітка Verisign CPS v1";
"06 0C 60 86 48 01 86 F8 45 01 07 01 01 02"	= "Verisign CPS v1 NSI";

"06 0A 60 86 48 01 86 F8 45 01 08 01"		= "ЦС Verisign SGC";

/* SET */

"06 03 67 2A 00"	= "Тип вмісту";
"06 04 67 2A 00 00"	= "Дані PAN";
"06 04 67 2A 00 01"	= "Код PAN";
"06 04 67 2A 00 02"	= "Лише PAN";

"06 03 67 2A 01"	= "Розширення повідомлення";
"06 03 67 2A 02"	= "Поле";
"06 04 67 2A 02 00"	= "Повне ім’я";
"06 04 67 2A 02 01"	= "Ім’я";
"06 04 67 2A 02 02"	= "Прізвище";
"06 04 67 2A 02 03"	= "Прізвище від народження";
"06 04 67 2A 02 04"	= "Назва розташування";
"06 04 67 2A 02 05"	= "Ідентифікаційний номер";
"06 04 67 2A 02 06"	= "Місяць";
"06 04 67 2A 02 07"	= "Дата";
"06 04 67 2A 02 08"	= "Адреса";
"06 04 67 2A 02 09"	= "Телефон";
"06 04 67 2A 02 0A"	= "Сума";
"06 04 67 2A 02 0B"	= "Номер запису";
"06 04 67 2A 02 0C"	= "Фраза-пароль";

"06 03 67 2A 03"		= "Атрибут";
"06 04 67 2A 03 00"		= "Сертифікат";
"06 05 67 2A 03 00 00"	= "Відбиток кореневого ключа";
"06 05 67 2A 03 00 01"	= "Додаткова політика";

"06 03 67 2A 04"	= "Алгоритм";
"06 03 67 2A 05"	= "Політика";
"06 04 67 2A 05 00"	= "Корінь";
"06 03 67 2A 06"	= "Модуль";
"06 03 67 2A 07"	= "Розширення сертифіката";
"06 04 67 2A 07 00"	= "Хешований ключ кореня";
"06 04 67 2A 07 01"	= "Тип сертифіката";
"06 04 67 2A 07 02"	= "Торгові дані";
"06 04 67 2A 07 03"	= "Потрібний сертифікат карти";
"06 04 67 2A 07 04"	= "Тунелювання";
"06 04 67 2A 07 05"	= "Розширення SET";
"06 04 67 2A 07 06"	= "Кваліфікатор SET";

"06 03 67 2A 08"	= "Клас";
"06 04 67 2A 08 01"		= "IATA-ATA";
"06 04 67 2A 08 04"		= "VISA";
"06 04 67 2A 08 05"		= "MasterCard";
"06 04 67 2A 08 1E"		= "Diners";
"06 04 67 2A 08 22"		= "American Express";
"06 05 67 2A 08 AE 7B"	= "Novus";

"06 03 67 2A 09"	= "Постачальник";
"06 04 67 2A 09 00"	= "GlobeSet";
"06 04 67 2A 09 01"	= "IBM";
"06 04 67 2A 09 02"	= "CyberCash";
"06 04 67 2A 09 03"	= "Terisa";
"06 04 67 2A 09 04"	= "RSADSI";
"06 04 67 2A 09 05"	= "VeriFone";
"06 04 67 2A 09 06"	= "TrinTech";
"06 04 67 2A 09 07"	= "BankGate";
"06 04 67 2A 09 08"	= "GTE";
"06 04 67 2A 09 09"	= "CompuSource";
"06 04 67 2A 09 0A"	= "Griffin";
"06 04 67 2A 09 0B"	= "Certicom";
"06 04 67 2A 09 0C"	= "OSS";
"06 04 67 2A 09 0D"	= "TenthMountain";
"06 04 67 2A 09 0E"	= "Antares";
"06 04 67 2A 09 0F"	= "ECC";
"06 04 67 2A 09 10"	= "Maithean";
"06 04 67 2A 09 11"	= "Netscape";
"06 04 67 2A 09 12"	= "Verisign";
"06 04 67 2A 09 13"	= "BlueMoney";
"06 04 67 2A 09 14"	= "Lacerte";
"06 04 67 2A 09 15"	= "Fujitsu";
"06 04 67 2A 09 16"	= "eLab";
"06 04 67 2A 09 17"	= "Entrust";
"06 04 67 2A 09 18"	= "VIAnet";
"06 04 67 2A 09 19"	= "III";
"06 04 67 2A 09 1A"	= "OpenMarket";
"06 04 67 2A 09 1B"	= "Lexem";
"06 04 67 2A 09 1C"	= "Intertrader";
"06 04 67 2A 09 1D"	= "Persimmon";
"06 04 67 2A 09 1E"	= "NABLE";
"06 04 67 2A 09 1F"	= "espace-net";
"06 04 67 2A 09 20"	= "Hitachi";
"06 04 67 2A 09 21"	= "Microsoft";
"06 04 67 2A 09 22"	= "NEC";
"06 04 67 2A 09 23"	= "Mitsubishi";
"06 04 67 2A 09 24"	= "NCR";
"06 04 67 2A 09 25"	= "e-COMM";
"06 04 67 2A 09 26"	= "Gemplus";

"06 03 67 2A 0A"	= "Національний";
"06 05 67 2A 0A E2 00"	= "Японія";

/* Draft SET (deprecated) */

"06 04 86 8D 6F 02"	= "Хешований ключ кореня";
"06 04 86 8D 6F 03"	= "Тип сертифіката";
"06 04 86 8D 6F 04"	= "Торгові дані";
"06 04 86 8D 6F 05"	= "Потрібний сертифікат карти";
"06 04 86 8D 6F 06"	= "Тунелювання";
"06 04 86 8D 6F 07"	= "Кваліфікатор SET";
"06 04 86 8D 6F 63"	= "Дані SET";

/* Apple */

"06 06 2A 86 48 86 F7 63"		= "Apple";
"06 07 2A 86 48 86 F7 63 64"	= "Безпека даних Apple";

"06 08 2A 86 48 86 F7 63 64 01" = "Ідентифікатор політики довіри Apple";
"06 09 2A 86 48 86 F7 63 64 01 01"  = "Політика Apple iSign";
"06 09 2A 86 48 86 F7 63 64 01 02"  = "Базова політика X.509 Apple";
"06 09 2A 86 48 86 F7 63 64 01 03"  = "Політика SSL Apple";
"06 09 2A 86 48 86 F7 63 64 01 04"  = "Політика створення локальних сертифікатів Apple";
"06 09 2A 86 48 86 F7 63 64 01 05"  = "Політика створення локальних ЗПС Apple";
"06 09 2A 86 48 86 F7 63 64 01 06"  = "Політика відкликання СВС Apple ";
"06 09 2A 86 48 86 F7 63 64 01 07"  = "Політика відкликання за протоколом OCSP Apple ";
"06 09 2A 86 48 86 F7 63 64 01 08"  = "Політика S/MIME Apple";
"06 09 2A 86 48 86 F7 63 64 01 09"  = "Політика відкритої автентифікації Apple";
"06 09 2A 86 48 86 F7 63 64 01 0A"  = "Політика підписання оновлень для програмного забезпечення Apple";
"06 09 2A 86 48 86 F7 63 64 01 0B"  = "Політика IPsec Apple";
"06 09 2A 86 48 86 F7 63 64 01 0C"  = "Політика iChat Apple";
"06 09 2A 86 48 86 F7 63 64 01 0D"  = "Політика підписання ресурсів Apple";
"06 09 2A 86 48 86 F7 63 64 01 0E"  = "Політика Kerberos Client Apple";
"06 09 2A 86 48 86 F7 63 64 01 0F"  = "Політика Kerberos Server Apple";
"06 09 2A 86 48 86 F7 63 64 01 10"  = "Політика підписання коду Apple";
"06 09 2A 86 48 86 F7 63 64 01 11"  = "Політика підписання пакетів Apple";

"06 08 2A 86 48 86 F7 63 64 02" = "Ідентифікатор алгоритму захисту Apple";
"06 09 2A 86 48 86 F7 63 64 02 01"  = "Швидке еліптичне шифрування (FEE)";
"06 09 2A 86 48 86 F7 63 64 02 02"  = "Безпечне стискання Apple (ASC)";
"06 09 2A 86 48 86 F7 63 64 02 03"  = "Шифрування FEE з підписом MD5";
"06 09 2A 86 48 86 F7 63 64 02 04"  = "Шифрування FEE з підписом SHA-1";
"06 09 2A 86 48 86 F7 63 64 02 05"  = "Криптографічний захист FEED Apple";
"06 09 2A 86 48 86 F7 63 64 02 06"  = "Apple FEED (експерементально)";
"06 09 2A 86 48 86 F7 63 64 02 07"  = "Шифрування FEE з підписом ECDSA";

"06 08 2A 86 48 86 F7 63 64 03" = "Ідентифікатор сертифіката Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 01"  = "Запит на сертифікат Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 01"  = "Запит на цифровий сертифікат Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 02"  = "Запит на сертифікат підписання електронної пошти Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 03"  = "Запит на сертифікат криптографічного захисту електронної пошти Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 04"  = "Запит на список архівів Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 05"  = "Запит на зберігання архіву Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 06"  = "Запит на витяг архіву Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 01 07"  = "Запит на видалення архіву Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 02"  = "Розширення сертифіката Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 01"   = "Цифровий підпис Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 02"   = "Підписання електронної пошти Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 02 03"   = "Криптографічний захист електронної пошти Apple .Mac";
"06 09 2A 86 48 86 F7 63 64 03 03"  = "Значення запиту на сертифікат Apple .Mac";
"06 0A 2A 86 48 86 F7 63 64 03 03 01"  = "Ім’я користувача";
"06 0A 2A 86 48 86 F7 63 64 03 03 02"  = "Пароль";
"06 0A 2A 86 48 86 F7 63 64 03 03 03"  = "Ім’я хоста";
"06 0A 2A 86 48 86 F7 63 64 03 03 04"  = "Оновити прапорець";
"06 0A 2A 86 48 86 F7 63 64 03 03 05"  = "Асинхронний прапорець";

"06 08 2A 86 48 86 F7 63 64 04" = "Використання розширеного ключа Apple";
"06 09 2A 86 48 86 F7 63 64 04 01"  = "Підписання коду Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 01"  = "Підписання коду Apple (розробка)";
"06 0A 2A 86 48 86 F7 63 64 04 01 02"  = "Підписання оновлень для програмного забезпечення Apple";
"06 0A 2A 86 48 86 F7 63 64 04 01 03"  = "Підписання коду Apple (резервний)";
"06 0A 2A 86 48 86 F7 63 64 04 01 04"  = "Підписання ресурсів Apple";
"06 09 2A 86 48 86 F7 63 64 04 02"  = "Підписання iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 03"  = "Криптографічний захист iChat Apple";
"06 09 2A 86 48 86 F7 63 64 04 04"  = "Цифровий підпис системи Apple";

"06 08 2A 86 48 86 F7 63 64 05" = "Політики сертифікатів Apple";
"06 09 2A 86 48 86 F7 63 64 05 01"  = "Політика сертифікатів Apple";
"06 09 2A 86 48 86 F7 63 64 05 02"  = "Політика сертифіката Apple .Mac";

/* Extended key usage */

"06 04 55 1D 25 03"					= "Підписання коду";

/* Intel CDSA-specific */

"06 07 60 86 48 01 86 F8 4D"	= "Intel";
"06 08 60 86 48 01 86 F8 4D 02"	= "Захист CDSA Intel";

"06 09 60 86 48 01 86 F8 4D 02 01"	= "Формати захисту CDSA Intel";
"06 0B 60 86 48 01 86 F8 4D 02 01 01 01"	= "Розширення сертифікатів X.509 v3";
"06 0C 60 86 48 01 86 F8 4D 02 01 01 01 32"	= "Розширення особистих сертифікатів X.509v3";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 01"	= "Растрове зображення підпису теми";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 02"	= "Зображення теми";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 03"	= "Електронна адреса суб’єкта";
"06 0D 60 86 48 01 86 F8 4D 02 01 01 01 32 04"	= "Використовувати винятки";

"06 0A 60 86 48 01 86 F8 4D 02 02 05"	= "Алгоритми захисту CDSA Intel";
"06 0B 60 86 48 01 86 F8 4D 02 02 05 51"	= "SHA-1 з ECDSA";

/* end */
